#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.РаботаСотрудников.Форма.ФормаСписка.Открытие");
	
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.РаботаСотрудников.ФормаСписка",Новый Структура("Отбор", Отбор), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
