
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ПротоколПередачиДокументовДисконтномуСерверу.Форма.ФормаСписка.Открытие");
           
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументПродажи", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.ПротоколПередачиДокументовДисконтномуСерверу.Форма.ФормаСписка", СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти
