#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	// 0 ТаблицаПлощадьТорговогоПространства
	"ВЫБРАТЬ
	|	УстановкаПлощадиВыкладкиПлощадиВыкладки.НомерСтроки КАК НСтр,
	|	УстановкаПлощадиВыкладкиПлощадиВыкладки.ТоварнаяГруппа,
	|	УстановкаПлощадиВыкладкиПлощадиВыкладки.ПлощадьВыкладки,
	|	УстановкаПлощадиВыкладки.Магазин,
	|	УстановкаПлощадиВыкладки.ДатаУстановкиПлощадиВыкладки КАК Период
	|ИЗ
	|	Документ.УстановкаПлощадиВыкладки.ПлощадиВыкладки КАК УстановкаПлощадиВыкладкиПлощадиВыкладки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаПлощадиВыкладки КАК УстановкаПлощадиВыкладки
	|		ПО УстановкаПлощадиВыкладкиПлощадиВыкладки.Ссылка = УстановкаПлощадиВыкладки.Ссылка
	|ГДЕ
	|	УстановкаПлощадиВыкладки.Ссылка = &Ссылка
	|	И УстановкаПлощадиВыкладкиПлощадиВыкладки.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НСтр");

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлощадьТорговогоПространства", Результат[0].Выгрузить());
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
