
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.ПомощникЗачетаОплат.Форма.Форма.Открытие");

	Документ = ПараметрКоманды;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		ЗаказПоставщику = ОбщегоНазначенияРТВызовСервера.ЗначениеРеквизитаОбъекта(Документ, "ЗаказПоставщику");
		Документ = ?(ЗначениеЗаполнено(ЗаказПоставщику), ЗаказПоставщику, Документ);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Документ", Документ);
	
	ОткрытьФорму("Обработка.ПомощникЗачетаОплат.Форма.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
