
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("МассивПоискаКарт") Тогда
		Для Каждого Карта Из Параметры.МассивПоискаКарт Цикл
			НоваяСтрока = ТаблицаКарт.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Карта);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКарт

&НаКлиенте
Процедура ТаблицаКартВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураВыбора = ПодготовитьСтруктуруВыбора();
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураВыбора = ПодготовитьСтруктуруВыбора();
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора()
	
	СтруктураВыбора = Неопределено;
	
	ТекущиеДанные = Элементы.ТаблицаКарт.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураВыбора = Новый Структура;
		СтруктураВыбора.Вставить("Ссылка", ТекущиеДанные.Ссылка);
		СтруктураВыбора.Вставить("ВладелецКарты", ТекущиеДанные.ВладелецКарты);
		СтруктураВыбора.Вставить("НомерТелефона", ТекущиеДанные.НомерТелефона);
		СтруктураВыбора.Вставить("АдресЭП"      , ТекущиеДанные.АдресЭП);
	КонецЕсли;
	
	Возврат СтруктураВыбора;
	
КонецФункции	

#КонецОбласти

