
#Область ПрограммныйИнтерфейс

// Процедура записывает данные в регистр.
//
// Параметры:
//	ТаблицаРегистра	- Таблица значений, структура = структура регистра.
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеВРегистр(ТаблицаРегистра) Экспорт
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.РаспределениеПродаж.СоздатьНаборЗаписей();
		КоличествоСтрок = ТаблицаРегистра.Количество()-1;
		
		Для Инд = 0 По КоличествоСтрок Цикл
			
			СтрокаТаблицыРегистра = ТаблицаРегистра[КоличествоСтрок - Инд];
			
			Если СтрокаТаблицыРегистра.Очистить Тогда
				
				НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
				НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
				НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать(Истина);
				ТаблицаРегистра.Удалить(СтрокаТаблицыРегистра);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицыРегистра Из ТаблицаРегистра Цикл
			
			НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
			НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
			НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицыРегистра);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.РаспределениеПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
