
#Область ПрограммныйИнтерфейс

// Вызывается перед проверкой акцизной марки на уникальность.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой производится контроль,
//  Операция - Строка - содержит выполняемую операцию. В процедуре можно переопределить параметр.
//                      Возможные значения см. в описании АкцизныеМаркиЕГАИСПереопределяемый.ПроверитьУникальностьАкцизнойМарки().
//
Процедура ПриОпределенииОперацииКонтроляАкцизныхМарок(Форма, Операция) Экспорт
	
	Если Форма.ИмяФормы = "Обработка.РМКУправляемыйРежим.Форма.Форма"
		ИЛИ Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента" Тогда
		Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") Тогда
			Операция = "Возврат";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
