#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Ссылка.Магазин КАК Магазин,
	|	ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Ссылка.Дата КАК Период,
	|	ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Ссылка.Организация КАК Организация,
	|	ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.ДокументРасчета = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.ДокументРасчета
	|	КОНЕЦ КАК ДокументРасчета,
	|	ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Сумма > 0
	|			ТОГДА ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Сумма
	|		ИНАЧЕ -ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Сумма > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения
	|ИЗ
	|	Документ.ВводОстатковРасчетовСКлиентами.РасчетыСКлиентами КАК ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами
	|ГДЕ
	|	ВводОстатковРасчетовСКлиентамиРасчетыСКлиентами.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСКлиентами", Результат[0].Выгрузить());
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
