
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с контрагентами".
// ОбщийМодуль.ПроверкаКонтрагентовФНСПовтИсп.
//
// Серверные процедуры и функции для повторного использования проверки контрагентов ФНС:
//  - проверка доступности сервиса;
//  - заполнения параметров запроса к сервису ФНС.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Проверяет наличие доступа к веб-сервису ФНС.
//
// Возвращаемое значение:
//  Булево - если Истина, доступ к веб-сервису ФНС есть.
//
Функция ПроверитьДоступностьСервиса() Экспорт
	
	Возврат ПроверкаКонтрагентовФНС.ПроверитьДоступностьСервиса();
	
КонецФункции

#КонецОбласти
