
Функция ПолучитьВидОплатыПоКодуВидаОплатыККМ(СсылкаНаСоответствие, КодВидаОплатыККМ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаСоответствие) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	Справочник.СоответствиеВидовОплатыСККМOffline.СоответствиеВидовОплаты КАК СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты
	|ГДЕ
	|	СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.Ссылка = &СсылкаНаСоответствие
	|	И СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.КодВидаОплатыККМOffline = &КодВидаОплатыККМOffline";
	
	Запрос.УстановитьПараметр("КодВидаОплатыККМOffline", КодВидаОплатыККМ);
	Запрос.УстановитьПараметр("СсылкаНаСоответствие", СсылкаНаСоответствие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ВидОплаты;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции