#Область ПрограммныйИнтерфейс

// Возвращает ссылку на счет-фактуру по документу.
//
// Параметры:
//  Основание - ДокументСсылка - Документ, на основании которого вводится счет-фактура;
//  Организация - СправочникСсылка.Организации - Организация, на имя которой оформляется счет-фактура.
//
// Возвращаемое значение:
//  ДокументСсылка.СчетФактураВыданный, Неопределено - Ссылка на счет-фактуру по документу.
//		Если счет-фактура не найдена - Неопределено.
//
Функция СчетФактураДокумента(Основание, Организация = Неопределено, Проведен = Ложь) Экспорт
	
	Перем РеквизитыСчетаФактуры;
	
	Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(Основание, Организация, РеквизитыСчетаФактуры, Проведен);
	
	Если РеквизитыСчетаФактуры <> Неопределено Тогда
		СчетФактураДокумента = РеквизитыСчетаФактуры.Ссылка;
	Иначе
		СчетФактураДокумента = Неопределено;
	КонецЕсли;
	
	Возврат СчетФактураДокумента;
	
КонецФункции

// Возвращает структуру значений кассовой дисциплины выемки при закрытии смены.
// Параметры:
//   КассаККМ - справочник "КассаККМ".
// Возвращаемое значение:
//   Структура
Функция КассоваяДисциплинаВыемкиПриЗакрытииСмены(КассаККМ) Экспорт
	
	Возврат ПродажиСервер.КассоваяДисциплинаВыемкиПриЗакрытииСмены(КассаККМ);
	
КонецФункции

#КонецОбласти