
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВариантаОборотДДС = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОборотДДС");
	НастройкиВариантаОборотДДС.Описание = 
		НСтр("ru = 'Информация о движении наличных денежных средств в разрезе организаций и статей движения'");
	
	НастройкиВариантаОборотДДСПоМесяцам =
		ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОборотДДСПоМесяцам");
		
	НастройкиВариантаОборотДДСПоМесяцам.Описание =
		НСтр("ru = 'Информация о движении наличных денежных средств в разрезе организаций и статей движения (по месяцам)'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
