#Область ВерсияСхемОбмена

// Возвращает соответствие схем обмена и Имен пространств XDTO
Функция СоответствиеВерсийСхемыОбмена() Экспорт
	
	СоответствиеВерсийСхемыОбмена = Новый Соответствие;
	
	СоответствиеВерсийСхемыОбмена.Вставить(Перечисления.ВерсииСхемОбменовДаннымиГИСМ.Версия2_32, "http://nalog.ru/MarkInfo/2_32");
	СоответствиеВерсийСхемыОбмена.Вставить(Перечисления.ВерсииСхемОбменовДаннымиГИСМ.Версия2_40, "http://nalog.ru/MarkInfo/2_40");
	
	Возврат СоответствиеВерсийСхемыОбмена;
	
КонецФункции

#КонецОбласти
