#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ")
		И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Ключ.Организация) Тогда
			Элементы.Организация.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Ключ.Склад) Тогда
			Элементы.Склад.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	Иначе
		
		Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
			
			Если Параметры.ЗначенияЗаполнения.Свойство("Склад") Тогда
				
				Склад = Параметры.ЗначенияЗаполнения.Склад;
				Если Склад <> Неопределено 
					И ЗначениеЗаполнено(Склад) Тогда
					
					Элементы.Склад.ТолькоПросмотр = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Параметры.ЗначенияЗаполнения.Свойство("Организация") Тогда
				
				Организация = Параметры.ЗначенияЗаполнения.Организация;
				Если Организация <> Неопределено 
					И ЗначениеЗаполнено(Организация) Тогда
					
					Элементы.Организация.ТолькоПросмотр = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(Отказ,,Запись.Организация);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти