#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает реквизиты которые необходимо заблокировать после сохранения.
// Возвращаемое значение:
//	Массив - массив наименований блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Возврат Результат;
	
КонецФункции

// Возвращает вид оплаты, если найден один вид оплаты в договоре эквайринга.
// 
// Параметры:
//	ДоговорыЭквайринга - СправочникСсылка.ДоговорыЭквайринга - Ссылка на договор эквайринга.
//
// Возвращаемое значение:
//	Структура - Вид оплаты договора эквайринга.
//
Функция ВидОплатыПоУмолчанию(ДоговорЭквайринга) Экспорт
	
	СтруктураПараметровПоУмолчанию = Новый Структура();
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	Справочник.УдалитьДоговорыЭквайринга.ТарифыЗаРасчетноеОбслуживание КАК ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание
	|ГДЕ
	|	ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание.Ссылка = &ДоговорЭквайринга
	|	И НЕ ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание.Ссылка.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("ДоговорЭквайринга", ДоговорЭквайринга);
	ВыборкаПараметрыПоУмолчанию = Запрос.Выполнить().Выбрать();
	Если ВыборкаПараметрыПоУмолчанию.Количество() = 1.00 И ВыборкаПараметрыПоУмолчанию.Следующий() Тогда
		СтруктураПараметровПоУмолчанию.Вставить("ВидОплаты", ВыборкаПараметрыПоУмолчанию.ВидОплаты);
	Иначе
		СтруктураПараметровПоУмолчанию.Вставить("ВидОплаты", Справочники.ВидыОплатЧекаККМ.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураПараметровПоУмолчанию;
	
КонецФункции

#КонецОбласти

#КонецЕсли