&НаСервере
Процедура ИнициализацияРеквизитов()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.nb_ДатаРегистрации = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры	

Процедура ОчиститьРеквизиты(ИсключитьИзОчистки)
	МетаданныеОбъекта = Метаданные.Обработки.nb_ОбработкаАнкетУчастниковПрограммыЛояльностиДружба;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		Если СтрНайти(ИсключитьИзОчистки, Реквизит.Имя) > 0 Тогда
			Продолжить;
		КонецЕсли;	
		Объект[Реквизит.Имя] = Неопределено;
	КонецЦикла;	
	Объект.Клиент = Неопределено;
КонецПроцедуры	


&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Отказ)
	ФизЛицоССылка = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьФизЛицоПоБК(Объект.nb_БК);
	Если НЕ ФизЛицоССылка.Пустая() Тогда
		Попытка
			НачатьТранзакцию();
			ФизЛицоОбъект = ФизЛицоССылка.ПолучитьОбъект();
			
			ЗаполнитьЗначенияСвойств(ФизЛицоОбъект, Объект);
			ФизЛицоОбъект.Наименование = Объект.Фамилия + " " +Объект.Имя + " " + Объект.Отчество;
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ФизЛицоОбъект, Объект.EMail, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица);
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ФизЛицоОбъект, Объект.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица);
			ФизЛицоОбъект.Записать();
			
			МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ФизЛицо = ФизЛицоССылка;
			МенеджерЗаписи.Период = ФизЛицоОбъект.ДатаРождения;
			МенеджерЗаписи.Фамилия = Объект.Фамилия;
			МенеджерЗаписи.Имя = Объект.Имя;
			МенеджерЗаписи.Отчество = Объект.Отчество;
			МенеджерЗаписи.Записать(Истина);

			
			ДисконтнаяКартаСсылка = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьДисконтнуюКартуПоБК(ФизЛицоССылка, Объект.nb_БК);
			Если НЕ ДисконтнаяКартаСсылка.Пустая() Тогда
				ДисконтнаяКартаОбъект = ДисконтнаяКартаСсылка.ПолучитьОбъект();
				ДисконтнаяКартаОбъект.Наименование = ДисконтнаяКартаОбъект.КодКарты + " " + ФизЛицоОбъект.Наименование; 
				ДисконтнаяКартаОбъект.Записать();
			КонецЕсли;	
			
			
			ЗафиксироватьТранзакцию();
			Объект.Клиент = ФизЛицоОбъект.ССылка;
		Исключение
			Отказ = Истина;
			ОтменитьТранзакцию();
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегистрацию(Команда)
	Отказ = Ложь;
	ВыполнитьРегистрациюНаСервере(Отказ);
	Если НЕ Отказ Тогда
		Сообщить("Анкета зарегистрирована: "+Объект.Клиент);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияРеквизитов();
КонецПроцедуры

&НаСервере
Процедура nb_БКПриИзмененииНаСервере()
	ОчиститьРеквизиты("nb_БК, nb_ДатаРегистрации, Ответственный");
	Объект.Клиент = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьФизЛицоПоБК(Объект.nb_БК);
	Если ЗначениеЗаполнено(Объект.Клиент.nb_ДатаРегистрации) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.Клиент);
		ФИО = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьФИОФизЛица(Объект.Клиент);
		ЗаполнитьЗначенияСвойств(Объект, ФИО);
		
		Объект.EMail 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Клиент, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица);
		Объект.Телефон 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Клиент, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура nb_БКПриИзменении(Элемент)
	nb_БКПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаНоваяАнкетаНаСервере()
	// Очистить все поля
	ОчиститьРеквизиты("nb_ДатаРегистрации, Ответственный");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНоваяАнкета(Команда)
	КомандаНоваяАнкетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура РекомендательПриИзмененииНаСервере()
	Объект.Рекомендатель_БК = Объект.Рекомендатель.nb_БК;	
КонецПроцедуры

&НаКлиенте
Процедура РекомендательПриИзменении(Элемент)
	РекомендательПриИзмененииНаСервере();
КонецПроцедуры
