&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
	ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Справочник.КассыККМ.Форма.ФормаСписка.Открытие");

    ПараметрыФормы = Новый Структура("ЗапретитьИзменениеМагазина, Отбор", Истина, Новый Структура("Магазин", ПараметрКоманды));
	ПараметрыФормы.Вставить("ДополнительныеСкрываемыеЭлементы", Новый Структура("Магазин, ОтборМагазин"));
	ОткрытьФорму("Справочник.КассыККМ.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
