#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает формат магазина, если формат один в справочнике.
//
// Возвращаемое значение:
//	СправочникСсылка.ФорматыМагазинов - Найденный формат магазина, ФорматыМагазинов.ПустаяСсылка - если форматов нет или
//	                                    больше одного.
//
Функция ПолучитьФорматМагазинаПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ФорматыМагазинов.Ссылка КАК ФорматМагазина
	|ИЗ
	|	Справочник.ФорматыМагазинов КАК ФорматыМагазинов
	|ГДЕ
	|	(НЕ ФорматыМагазинов.ЭтоГруппа)
	|	И (НЕ ФорматыМагазинов.ПометкаУдаления)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		ФорматМагазина = Выборка.ФорматМагазина;
	Иначе
		ФорматМагазина = Справочники.ФорматыМагазинов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ФорматМагазина;

КонецФункции

// Формирует массив блокируемых реквизитов объекта.
// Возвращаемое значение:
//	Результат - Массив, содержащий строковые идентификаторы реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ПравилоЦенообразования");
	
	Возврат Результат;

КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
