
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВариантаНаличныеДС = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "НаличныеДенежныеСредства");
	НастройкиВариантаНаличныеДС.Описание = НСтр("ru = 'Информация об остатках и движения наличных денежных средств'");
	
	НастройкиВариантаДеньгиКПоступлениюПоОрганизации =
		ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДеньгиКПоступлениюПоОрганизации");
	
	НастройкиВариантаДеньгиКПоступлениюПоОрганизации.Описание =
		НСтр("ru = 'Информация о наличных ДС к поступлению в кассы организации'");
	
	
	НастройкиВариантаДеньгиКПоступлениюМеждуОрганизациями =
		ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДеньгиКПоступлениюМеждуОрганизациями");
	
	НастройкиВариантаДеньгиКПоступлениюМеждуОрганизациями.Описание =
		НСтр("ru = 'Информация о наличных ДС к поступлению в кассы при перемещении ДС между организациями'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
