#Область ПрограммныйИнтерфейс

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
Функция ПолучитьСостояниеКассовойСмены(КассаККМ) Экспорт
	
	Возврат РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
КонецФункции // ПолучитьСостояниеКассовойСменыСервер()

// Процедура выполняет закрытие кассовой смены.
//
Функция ЗакрытьКассовуюСмену(КассаККМ, ОписаниеОшибки, СсылкаНаОтчет) Экспорт
	
	Возврат РозничныеПродажиСервер.ЗакрытьКассовуюСмену(КассаККМ, ОписаниеОшибки, СсылкаНаОтчет);
	
КонецФункции // ЗакрытьКассовуюСменуСервер()


// Функция возвращает текущую сумму положительного остатка денежных средств (ДС) по кассе ККМ.
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ
// Возвращаемое значение:
//  Число
//
Функция СуммаОстаткаДСПоКассеККМ(КассаККМ, ДоговорАгента = Неопределено) Экспорт
	
	Возврат РозничныеПродажиСервер.СуммаОстаткаДСПоКассеККМ(КассаККМ, ДоговорАгента);
	
КонецФункции // СуммаОстаткаДСПоКассеККМ()

// Функция возвращает текущую сумму положительного остатка денежных средств (ДС) по кассе ККМ.
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ
// Возвращаемое значение:
//  Число
//
Функция МассивАгентскихДоговоровВКассеККМ(КассаККМ) Экспорт
	
	Возврат РозничныеПродажиСервер.МассивАгентскихДоговоровВКассеККМ(КассаККМ);
	
КонецФункции // СуммаОстаткаДСПоКассеККМ()

// Функция собирает данные для запроса суммы фактической выемки.
//
// Возвращаемое значение:
//  Структура
Функция ДанныеДляЗапросаСуммыФактическойВыемки(КассаККМ) Экспорт
	
	Возврат РозничныеПродажиСервер.ДанныеДляЗапросаСуммыФактическойВыемки(КассаККМ);
	
КонецФункции // ДанныеДляЗапросаСуммыФактическойВыемки()

// Функция возвращает данные эквайрингового терминала.
//
// Возвращаемое значение:
//  Структура
Функция СтруктураДанныхЭТ(Терминал) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭквайринговыеТерминалы.ПодключаемоеОборудование,
	|	ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования,
	|	ЭквайринговыеТерминалы.Ссылка
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Терминал);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СтруктураВозврата = Новый Структура("ПодключаемоеОборудование, ИспользоватьБезПодключенияОборудования");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	Иначе
		СтруктураВозврата.ПодключаемоеОборудование = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
		СтруктураВозврата.ИспользоватьБезПодключенияОборудования = Истина;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти