
#Область ПрограммныйИнтерфейс

// Процедура пытается обновить продажи в дисконтном сервере
// или записать задание на обновление продаж в дисконтном сервере
// в зависимости от значения опции ИспользоватьОчередьДляПередачиДокументовДисконтномуСерверу.
Процедура ОтразитьПродажиВДисконтномСервере(ДокументСсылка, ЕстьОшибки) Экспорт
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОчередьДляПередачиДокументовДисконтномуСерверу") Тогда
		ДисконтныйСервер.ЗаписатьЗаданиеНаОбновлениеДисконтногоСервера(ДокументСсылка);
	Иначе
		ОбновленоУспешно = ДисконтныйСервер.ОбновитьДанныеОПродажах(ДокументСсылка, ЕстьОшибки);
		ДисконтныйСервер.ЗаписатьЗаданиеНаОбновлениеДисконтногоСервера(ДокументСсылка, ОбновленоУспешно);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
