#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Установка обязательных параметров.
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Пользовательские", КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных);
	ПараметрыДанных.Вставить("Текущие",          КомпоновщикНастроек.Настройки.ПараметрыДанных);
	
	ПараметрМагазин = ПараметрыДанных.Пользовательские.НайтиЗначениеПараметра(
						Новый ПараметрКомпоновкиДанных("ОбъектЦенообразования"));
	Магазин = Неопределено;
	Если ПараметрМагазин <> Неопределено Тогда
		Магазин = ПараметрМагазин.Значение;
	КонецЕсли;
	
	АссортиментСервер.ПроверитьНеобходимостьПереопределенияИВывестиОтчет(
		ЭтотОбъект,
		ДокументРезультат,
		ДанныеРасшифровки,
		СтандартнаяОбработка,
		Магазин);
	
	ОбщегоНазначенияРТ.ВывестиДатуФормированияОтчета(ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
