#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныВозвратовТоварныеГруппы");
	НастройкиВарианта.Описание = НСтр("ru='Информация о количестве и стоимости возвращенных покупателями товаров в разрезе причин возвратов и товарных групп'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныВозвратовМагазины");
	НастройкиВарианта.Описание = НСтр("ru='Информация о количестве и стоимости возвращенных покупателями товаров в разрезе причин возвратов и магазинов'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныВозвратовДетальный");
	НастройкиВарианта.Описание = НСтр("ru='Информация о количестве и стоимости возвращенных покупателями товаров в разрезе причин возвратов и номенклатурных позиций'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныВозвратовТоварныеКатегории");
	НастройкиВарианта.Описание = НСтр("ru='Информация о количестве и стоимости возвращенных покупателями товаров в разрезе причин возвратов и товарных категорий'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныВозвратовОтПокупателя, "ПричиныВозвратовТоварныеКатегории");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Продажи);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныВозвратовОтПокупателя, "ПричиныВозвратовТоварныеГруппы");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныВозвратовОтПокупателя, "ПричиныВозвратовМагазины");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныВозвратовОтПокупателя, "ПричиныВозвратовДетальный");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
