#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СтоимостнаяОценкаСкладаПоВидуЦены");
	НастройкиВарианта.Описание = НСтр("ru='Отчет позволяет получить стоимостную оценку товаров на складах в ценах по указанному виду цены'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СтоимостнаяОценкаСкладаВРозничныхЦенах");
	НастройкиВарианта.Описание = НСтр("ru='Отчет позволяет получить стоимостную оценку товаров на складах в розничных ценах'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СтоимостнаяОценкаСкладаПоВидуЦеныПоКатегориям");
	НастройкиВарианта.Описание = НСтр("ru='Отчет позволяет получить стоимостную оценку товаров на складах в разрезе товарных категорий в ценах по указанному виду цены'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СтоимостнаяОценкаСкладаВРозничныхЦенахПоКатегориям");
	НастройкиВарианта.Описание = НСтр("ru='Отчет позволяет получить стоимостную оценку товаров на складах в разрезе товарных категорий в розничных ценах'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтоимостнаяОценкаСклада, "СтоимостнаяОценкаСкладаПоВидуЦеныПоКатегориям");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Склад);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтоимостнаяОценкаСклада, "СтоимостнаяОценкаСкладаВРозничныхЦенахПоКатегориям");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Склад);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтоимостнаяОценкаСклада, "СтоимостнаяОценкаСкладаПоВидуЦены");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтоимостнаяОценкаСклада, "СтоимостнаяОценкаСкладаВРозничныхЦенах");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
