
#Область ПрограммныйИнтерфейс

// В процедуре требуется реализовать заполнение данных по номенклатуре для переданного соответствия штрихкодов.
//
// Параметры:
//  Штрихкоды - Соответствие - штрихкоды, не являющиеся штрихкодами упаковок и акцизных марок:
//   * Ключ - Строка - штрихкод,
//   * Значение - Структура - заполняемая структура, см. АкцизныеМаркиКлиентСервер.РезультатОбработкиШтрихкода().
//  КэшированныеЗначения - Структура - кэш формы документа.
//
Процедура ЗаполнитьИнформациюПоШтрихкодам(Штрихкоды, КэшированныеЗначения) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Возвращает Истина, если акцизная марка никогда раньше не продавалась. Ложь - в противном случае.
//
// Параметры:
//  Операция - Строка - текущая операция, для которой требуется осуществить контроль. Возможные значения:
//   "Продажа" - проверка пройдена, если продажи за минусом возвратов <= 0,
//   "Возврат" - проверка пройдена, если продажи за минусом возвратов >= 0,
//   "АктПостановкиНаБаланс" - проверка пройдена, если не было продаж, возвратов, актов постановок на баланс,
//   "АктСписания" - проверка пройдена, если продажи за минусом возвратов <= 0 и поставлено на баланс - списано >= 0.
//
//  КодАкцизнойМарки - Строка - код акцизной марки,
//  ТекстОшибки - Строка, ФорматированнаяСтрока - текст сообщения пользователю, если акцизная марка не уникальна. Выходной параметр.
//
Процедура ПроверитьУникальностьАкцизнойМарки(Операция, КодАкцизнойМарки, ТекстОшибки, ОрганизацияЕГАИС = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Операция) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАкцизнойМарки", КодАкцизнойМарки);
	Запрос.УстановитьПараметр("Возврат", Перечисления.ВидыОперацийЧекККМ.Возврат);
	Запрос.УстановитьПараметр("Продажа", Перечисления.ВидыОперацийЧекККМ.Продажа);
	
	Если Операция = "Продажа"
		ИЛИ Операция = "Возврат"
		ИЛИ Операция = "АктСписания" Тогда
		
		НевыгруженныеСтатусы = Новый Массив;
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПередачи);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПроведенияЕГАИС);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Отменен);
		Запрос.УстановитьПараметр("НевыгруженныеСтатусы", НевыгруженныеСтатусы);
		Запрос.УстановитьПараметр("Списание", "Списание");
		Запрос.УстановитьПараметр("Реализована", Перечисления.СтатусыАкцизныхМарок.Реализована);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЧекККМАкцизныеМарки.Ссылка КАК Ссылка,
		|	ЧекККМАкцизныеМарки.Ссылка.Дата КАК Дата,
		|	ЧекККМАкцизныеМарки.Ссылка.Номер КАК Номер,
		|	&Продажа КАК ПоследняяОперация
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
		|ГДЕ
		|	ЧекККМАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	И ЧекККМАкцизныеМарки.Ссылка.Проведен
		|	И ЧекККМАкцизныеМарки.Ссылка.ВидОперации = &Продажа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозвратАкцизныеМарки.Ссылка,
		|	ЧекККМВозвратАкцизныеМарки.Ссылка.Дата,
		|	ЧекККМВозвратАкцизныеМарки.Ссылка.Номер,
		|	&Возврат
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМВозвратАкцизныеМарки
		|ГДЕ
		|	ЧекККМВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	И ЧекККМВозвратАкцизныеМарки.Ссылка.Проведен
		|	И ЧекККМВозвратАкцизныеМарки.Ссылка.ВидОперации = &Возврат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЕГАИСАкцизныеМарки.Ссылка,
		|	ЧекЕГАИСАкцизныеМарки.Ссылка.Дата,
		|	ЧекЕГАИСАкцизныеМарки.Ссылка.Номер,
		|	&Продажа
		|ИЗ
		|	Документ.ЧекЕГАИС.АкцизныеМарки КАК ЧекЕГАИСАкцизныеМарки
		|ГДЕ
		|	(ЧекЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|			ИЛИ ЧекЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ЧекЕГАИСАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровАкцизныеМарки.Ссылка,
		|	РеализацияТоваровАкцизныеМарки.Ссылка.Дата,
		|	РеализацияТоваровАкцизныеМарки.Ссылка.Номер,
		|	&Продажа
		|ИЗ
		|	Документ.РеализацияТоваров.АкцизныеМарки КАК РеализацияТоваровАкцизныеМарки
		|ГДЕ
		|	(РеализацияТоваровАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|			ИЛИ РеализацияТоваровАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И РеализацияТоваровАкцизныеМарки.Ссылка.Проведен
		|	И РеализацияТоваровАкцизныеМарки.Ссылка.ПробитЧек
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЕГАИСВозвратАкцизныеМарки.Ссылка,
		|	ЧекЕГАИСВозвратАкцизныеМарки.Ссылка.Дата,
		|	ЧекЕГАИСВозвратАкцизныеМарки.Ссылка.Номер,
		|	&Возврат
		|ИЗ
		|	Документ.ЧекЕГАИСВозврат.АкцизныеМарки КАК ЧекЕГАИСВозвратАкцизныеМарки
		|ГДЕ
		|	(ЧекЕГАИСВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|			ИЛИ ЧекЕГАИСВозвратАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ЧекЕГАИСВозвратАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка,
		|	ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка.Дата,
		|	ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка.Номер,
		|	&Возврат
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.АкцизныеМарки КАК ВозвратТоваровОтПокупателяАкцизныеМарки
		|ГДЕ
		|	(ВозвратТоваровОтПокупателяАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|			ИЛИ ВозвратТоваровОтПокупателяАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктСписанияЕГАИСАкцизныеМарки.Ссылка,
		|	АктСписанияЕГАИСАкцизныеМарки.Ссылка.Дата,
		|	АктСписанияЕГАИСАкцизныеМарки.Ссылка.Номер,
		|	&Продажа
		|ИЗ
		|	Документ.АктСписанияЕГАИС.АкцизныеМарки КАК АктСписанияЕГАИСАкцизныеМарки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО АктСписанияЕГАИСАкцизныеМарки.Ссылка = СтатусыДокументовЕГАИС.Документ
		|			И (НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусы))
		|ГДЕ
		|	(АктСписанияЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|			ИЛИ АктСписанияЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И АктСписанияЕГАИСАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцизныеМаркиЕГАИС.Основание,
		|	АкцизныеМаркиЕГАИС.Основание.Дата,
		|	АкцизныеМаркиЕГАИС.Основание.Номер,
		|	&Продажа
		|ИЗ
		|	РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
		|ГДЕ
		|	АкцизныеМаркиЕГАИС.АкцизнаяМарка = &АкцизнаяМарка
		|	И АкцизныеМаркиЕГАИС.Статус = &Реализована
		|	И АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ,
		|	Ссылка УБЫВ";
		
		АкцизнаяМарка = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьАкцизнуюМаркуПоКоду(КодАкцизнойМарки);
		Запрос.УстановитьПараметр("АкцизнаяМарка", АкцизнаяМарка);
		Если ОрганизацияЕГАИС = Неопределено Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС", "");
		Иначе
			Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЕстьОшибка = Ложь;
			Если Операция = "Возврат" Тогда
				Если Выборка.ПоследняяОперация <> Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
					ЕстьОшибка = Истина;
				КонецЕсли;
			Иначе
				Если Выборка.ПоследняяОперация = Перечисления.ВидыОперацийЧекККМ.Продажа
					ИЛИ Выборка.ПоследняяОперация = "Списание" Тогда
					ЕстьОшибка = Истина;
				КонецЕсли;
			КонецЕсли;
			Если ЕстьОшибка Тогда
				МассивСтрок = Новый Массив;
				МассивСтрок.Добавить(НСтр("ru = 'Считанная акцизная марка'"));
				МассивСтрок.Добавить(" " + КодАкцизнойМарки + " ");
				МассивСтрок.Добавить(НСтр("ru = 'ранее была учтена в документе:'"));
				МассивСтрок.Добавить(Символы.ПС);
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
					ОбщегоНазначенияРТ.ПолучитьПредставлениеДокумента(Выборка.Ссылка, Выборка.Номер, Выборка.Дата),,,,
					ПолучитьНавигационнуюСсылку(Выборка.Ссылка)));
				
				ТекстОшибки = Новый ФорматированнаяСтрока(МассивСтрок);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Операция = "АктПостановкиНаБаланс" Тогда
		НевыгруженныеСтатусы = Новый Массив;
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ОшибкаПередачи);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ОшибкаПроведенияЕГАИС);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.Отменен);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.ОшибкаПередачи);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.АктОтказаОшибка);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.АктРасхожденийОтказОшибка);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.АктРасхожденийПодтверждениеОшибка);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.ЗапросНаОтменуПроведенияПринят);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.ОтмененКлиентом);
		НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.Отменен);
		
		Запрос.УстановитьПараметр("НевыгруженныеСтатусы", НевыгруженныеСтатусы);
		Запрос.УстановитьПараметр("Постановка", "Постановка");
		Запрос.УстановитьПараметр("Реализация", "Реализация");
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЧекККМАкцизныеМарки.Ссылка КАК Ссылка,
		|	ЧекККМАкцизныеМарки.Ссылка.Дата КАК Дата,
		|	ЧекККМАкцизныеМарки.Ссылка.Номер КАК Номер,
		|	&Продажа КАК ПоследняяОперация
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
		|ГДЕ
		|	ЧекККМАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	И ЧекККМАкцизныеМарки.Ссылка.Проведен
		|	И ЧекККМАкцизныеМарки.Ссылка.ВидОперации = &Продажа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозвратАкцизныеМарки.Ссылка,
		|	ЧекККМВозвратАкцизныеМарки.Ссылка.Дата,
		|	ЧекККМВозвратАкцизныеМарки.Ссылка.Номер,
		|	&Возврат
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМВозвратАкцизныеМарки
		|ГДЕ
		|	ЧекККМВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	И ЧекККМВозвратАкцизныеМарки.Ссылка.Проведен
		|	И ЧекККМВозвратАкцизныеМарки.Ссылка.ВидОперации = &Возврат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЕГАИСАкцизныеМарки.Ссылка,
		|	ЧекЕГАИСАкцизныеМарки.Ссылка.Дата,
		|	ЧекЕГАИСАкцизныеМарки.Ссылка.Номер,
		|	&Продажа КАК ПоследняяОперация
		|ИЗ
		|	Документ.ЧекЕГАИС.АкцизныеМарки КАК ЧекЕГАИСАкцизныеМарки
		|ГДЕ
		|	(ЧекЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	ИЛИ ЧекЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ЧекЕГАИСАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЕГАИСАкцизныеМарки.Ссылка,
		|	ЧекЕГАИСАкцизныеМарки.Ссылка.Дата,
		|	ЧекЕГАИСАкцизныеМарки.Ссылка.Номер,
		|	&Продажа КАК ПоследняяОперация
		|ИЗ
		|	Документ.ЧекЕГАИС.АкцизныеМарки КАК ЧекЕГАИСАкцизныеМарки
		|ГДЕ
		|	(ЧекЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	ИЛИ ЧекЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ЧекЕГАИСАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЕГАИСВозвратАкцизныеМарки.Ссылка,
		|	ЧекЕГАИСВозвратАкцизныеМарки.Ссылка.Дата,
		|	ЧекЕГАИСВозвратАкцизныеМарки.Ссылка.Номер,
		|	&Возврат
		|ИЗ
		|	Документ.ЧекЕГАИСВозврат.АкцизныеМарки КАК ЧекЕГАИСВозвратАкцизныеМарки
		|ГДЕ
		|	(ЧекЕГАИСВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	ИЛИ ЧекЕГАИСВозвратАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ЧекЕГАИСВозвратАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка,
		|	ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка.Дата,
		|	ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка.Номер,
		|	&Возврат
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.АкцизныеМарки КАК ВозвратТоваровОтПокупателяАкцизныеМарки
		|ГДЕ
		|	(ВозвратТоваровОтПокупателяАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	ИЛИ ВозвратТоваровОтПокупателяАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ВозвратТоваровОтПокупателяАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПостановкиЕГАИСАкцизныеМарки.Ссылка,
		|	ПостановкиЕГАИСАкцизныеМарки.Ссылка.Дата,
		|	ПостановкиЕГАИСАкцизныеМарки.Ссылка.Номер,
		|	&Постановка
		|ИЗ
		|	Документ.АктПостановкиНаБалансЕГАИС.АкцизныеМарки КАК ПостановкиЕГАИСАкцизныеМарки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО ПостановкиЕГАИСАкцизныеМарки.Ссылка = СтатусыДокументовЕГАИС.Документ
		|		И НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусы)
		|ГДЕ
		|	(ПостановкиЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
		|	ИЛИ ПостановкиЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки)
		|	И ПостановкиЕГАИСАкцизныеМарки.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТТНИсходящаяЕГАИСАкцизныеМарки.Ссылка,
		|	ТТНИсходящаяЕГАИСАкцизныеМарки.Ссылка.Дата,
		|	ТТНИсходящаяЕГАИСАкцизныеМарки.Ссылка.Номер,
		|	&Реализация
		|ИЗ
		|	Документ.ТТНИсходящаяЕГАИС.АкцизныеМарки КАК ТТНИсходящаяЕГАИСАкцизныеМарки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО ТТНИсходящаяЕГАИСАкцизныеМарки.Ссылка = СтатусыДокументовЕГАИС.Документ
		|ГДЕ
		|	ТТНИсходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки
		|	И ТТНИсходящаяЕГАИСАкцизныеМарки.Ссылка.Проведен
		|	И НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ,
		|	Ссылка УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ПоследняяОперация = Перечисления.ВидыОперацийЧекККМ.Продажа
				ИЛИ Выборка.ПоследняяОперация = "Постановка"
				ИЛИ Выборка.ПоследняяОперация = "Реализация" Тогда
				МассивСтрок = Новый Массив;
				МассивСтрок.Добавить(НСтр("ru = 'Считанная акцизная марка ранее была учтена в документе:'"));
				МассивСтрок.Добавить(Символы.ПС);
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
					ОбщегоНазначенияРТ.ПолучитьПредставлениеДокумента(Выборка.Ссылка, Выборка.Номер, Выборка.Дата),,,,
					ПолучитьНавигационнуюСсылку(Выборка.Ссылка)));
				
				ТекстОшибки = Новый ФорматированнаяСтрока(МассивСтрок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается перед проверкой акцизной марки на уникальность.
//
// Параметры:
//  ИмяФормы - Строка - имя формы, в которой производится контроль,
//  Операция - Строка - содержит выполняемую операцию. В процедуре можно переопределить параметр.
//                      Возможные значения см. в описании АкцизныеМаркиЕГАИСПереопределяемый.ПроверитьУникальностьАкцизнойМарки().
//
Процедура ПриОпределенииОперацииКонтроляАкцизныхМарок(ИмяФормы, Операция) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

Функция ДанныеДляЗаполненияСлужебныхРеквизитов(Товары) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.НомерСтроки,
	|	Т.ИдентификаторСтроки,
	|	Выразить(Т.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Выразить(Т.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС) КАК АлкогольнаяПродукция,
	|	Т.Справка2,
	|	Т.Количество
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки          КАК НомерСтроки,
	|	Товары.ИдентификаторСтроки  КАК ИдентификаторСтроки,
	|	Товары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	Товары.Справка2             КАК Справка2,
	|	Товары.Количество           КАК Количество,
	|	0                           КАК КоличествоАкцизныхМарок,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			И Товары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА Товары.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ
	|					ЕСТЬNULL(Товары.Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ЕСТЬNULL(Товары.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ)
	|	КОНЕЦ КАК МаркируемаяАлкогольнаяПродукция
	|ИЗ
	|	Товары КАК Товары");
	
	Запрос.Параметры.Вставить("Товары", Товары);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
КонецФункции

#КонецОбласти

