
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.ПомощникПриемкиОтгрузки.Форма.Форма.Открытие");
    
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Операция", "Приемка");
	ПараметрыФормы.Вставить("Распоряжение", ПараметрКоманды);
	ОткрытьФорму("Обработка.ПомощникПриемкиОтгрузки.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрКоманды, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
