#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает статус кассовой смены.
//
// Параметры:
//  КассоваяСменаСсылка - ДокументСсылка.КассоваяСмена
//
// Возвращаемое значение:
//  Перечисления.СтатусыКассовойСмены
//
Функция СтатусКассовойСмены(КассоваяСменаСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассоваяСмена.СтатусКассовойСмены КАК СтатусКассовойСмены
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КассоваяСменаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусКассовойСмены;
	Иначе
		Возврат Перечисления.СтатусыКассовойСмены.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
