#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("ДанныеОВремени.Сотрудник");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	СписокНеЗаполненныхСтрок = Новый СписокЗначений;
	
	КоличествоСтрок = ЭтотОбъект.ДанныеОВремени.Количество();
	

	Для Каждого СтрокаДанныеОВремени Из ЭтотОбъект.ДанныеОВремени Цикл
		Если Не ЗначениеЗаполнено(СтрокаДанныеОВремени.Сотрудник) И (СтрокаДанныеОВремени.НомерСтроки % 2) = 0 Тогда
			СписокНеЗаполненныхСтрок.Добавить(СтрокаДанныеОВремени.НомерСтроки / 2);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого НомерСтроки Из СписокНеЗаполненныхСтрок Цикл
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнено поле Сотрудник в строке %1'"), НомерСтроки);
		Поле = НСтр("ru = 'ДанныеОВремени.Сотрудник'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,,	Отказ);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
		ИнициализироватьДокумент();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Магазин = ЗначениеНастроекПовтИсп.ПолучитьМагазинПоУмолчанию(Магазин);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
