#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбор(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ВыбранныйПараметр = "[ВыборМЖ(" + СтрокаМужскойРод + "; " + СтрокаЖенскийРод + ")]";
		Закрыть(ВыбранныйПараметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Документ.ИнформационнаяРассылка.Форма.ФормулаМЖ.Открытие");

КонецПроцедуры

#КонецОбласти
