#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныВозвратовПоставщикам");
	НастройкиВарианта.Описание = НСтр("ru='Отчет позволяет провести оценку возвратов товаров относительно поступлений этих товаров в разрезе причин возвратов'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныВозвратовПоставщикамПоКатегориям");
	НастройкиВарианта.Описание = НСтр("ru='Отчет позволяет провести оценку возвратов товаров относительно поступлений этих товаров в разрезе причин возвратов и товарных категорий'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныВозвратовПоставщикам, "ПричиныВозвратовПоставщикамПоКатегориям");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.ЗапасыИЗакупки.Подсистемы.РаботаСПоставщиками);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныВозвратовПоставщикам, "ПричиныВозвратовПоставщикам");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
