
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	МассивШаблонов = ПолучитьИзВременногоХранилища(Параметры.АдресШаблоновВХранилище);
	Для Каждого Шаблон Из МассивШаблонов Цикл
		НоваяСтрока = ТаблицаШаблонов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Шаблон);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаШаблонов

&НаКлиенте
Процедура ТаблицаШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора()
	
	ТекущиеДанные = Элементы.ТаблицаШаблонов.ТекущиеДанные;
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("КодКарты", ТекущиеДанные.КодКарты);
	СтруктураВыбора.Вставить("НаименованиеШаблона", ТекущиеДанные.НаименованиеШаблона);
		
	Возврат СтруктураВыбора;
	
КонецФункции	

#КонецОбласти
