#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПреопределенныеЭлементы() Экспорт
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Товар.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о реализуемом товаре, за исключением подакцизного товара (наименование и иные сведения, описывающие товар)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ПодакцизныйТовар.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о реализуемом подакцизном товаре (наименование и иные сведения, описывающие товар)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПодакцизныйТовар;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Работа.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о выполняемой работе (наименование и иные сведения, описывающие работу)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Работа;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Услуга.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения об оказываемой услуге (наименование и иные сведения, описывающие услугу)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.СтавкаАзартнойИгры.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о приеме ставок при осуществлении деятельности по организации и проведению азартных игр'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СтавкаАзартнойИгры;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ВыигрышАзартнойИгры.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о выплате денежных средств в виде выигрыша при осуществлении деятельности по организации и проведению азартных игр'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВыигрышАзартнойИгры;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ЛотерейныйБилет.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о приеме денежных средств при реализации лотерейных билетов, электронных лотерейных билетов, приеме лотерейных ставок при осуществлении деятельности по организации и проведению лотерей'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ЛотерейныйБилет;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ВыигрышЛотереи.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о выплате денежных средств в виде выигрыша при осуществлении деятельности по организации и проведению лотерей'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВыигрышЛотереи;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ПредставлениеРИД.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПредоставлениеРИД;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Платеж.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения об авансе, задатке, предоплате, кредите, взносе в счет оплаты, пени, штрафе, вознаграждении, бонусе и ином аналогичном предмете расчета'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.СоставнойПредметРасчета.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о предмете расчета, состоящем из предметов, каждому из которых может быть присвоено значение от «0» до «10»'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СоставнойПредметРасчета;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ИнойПредметРасчета.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о предмете расчета, не относящемуся к предметам расчета, которым может быть присвоено значение от «0» до «11»'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ИнойПредметРасчета;
	ЭлементСправочникаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли