#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает доступные пользователю магазины.
Функция ДоступныеМагазины(УчитыватьТекущийМагазин = Ложь, Пользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Магазины.Ссылка КАК Магазин  
	|ИЗ
	|	Справочник.Магазины КАК Магазины");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	Иначе	
		УстановитьПривилегированныйРежим(Истина);
		Магазины = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Магазин");
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоступныеМагазины.Магазин КАК Магазин,
		|	ВЫБОР
		|		КОГДА (НЕ Пользователи.Подразделение ЕСТЬ NULL )
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Пометка,
		|	СправочникМагазины.Наименование КАК Наименование
		|ИЗ
		|	(ВЫБРАТЬ
		|		МагазиныУзла.Магазин КАК Магазин
		|	ИЗ
		|		ПланОбмена.ПоМагазину.Магазины КАК МагазиныУзла
		|	ГДЕ
		|		МагазиныУзла.Ссылка = &ЭтотУзел
		|		И (НЕ &ГлавныйУзел)
		|		И МагазиныУзла.Магазин В(&Магазины)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Магазины.Ссылка
		|	ИЗ
		|		Справочник.Магазины КАК Магазины
		|	ГДЕ
		|		&ГлавныйУзел
		|		И (НЕ Магазины.СкладУправляющейСистемы)
		|		И Магазины.Ссылка В(&Магазины)) КАК ДоступныеМагазины
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО (Пользователи.Ссылка = &Пользователь)
		|			И (Пользователи.Подразделение = ДоступныеМагазины.Магазин)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Магазины КАК СправочникМагазины
		|		ПО (СправочникМагазины.Ссылка = ДоступныеМагазины.Магазин)
		|ГДЕ
		|	(&УчитыватьТекущийМагазин
		|			ИЛИ ДоступныеМагазины.Магазин <> &ТекущийМагазин)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ПоМагазину.ЭтотУзел());
		Запрос.УстановитьПараметр("ГлавныйУзел", ПланыОбмена.ГлавныйУзел() = Неопределено);
		Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
		Запрос.УстановитьПараметр("УчитыватьТекущийМагазин", УчитыватьТекущийМагазин);
		Запрос.УстановитьПараметр("ТекущийМагазин", ПараметрыСеанса.ТекущийМагазин);
		Запрос.УстановитьПараметр("Магазины", Магазины);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
