
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПолучитьДанныеИзБуфераОбмена", 3);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьДанныеИзБуфераОбмена()
	
	ПолучитьДанныеИзБуфераОбменаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИзБуфераОбменаСервер()
	
	ТаблицаДанных.Очистить();
	ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена();
	ТаблицаДанных.Загрузить(ТаблицаТоваров);
	
КонецПроцедуры

#КонецОбласти