
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВидыАнализаМонитораПоУмолчанию() Экспорт
	
	РазделыПоУмолчанию = Новый Массив;
	РазделыПоУмолчанию.Добавить(КоличествоЧеков);
	РазделыПоУмолчанию.Добавить(СреднийЧек);
	РазделыПоУмолчанию.Добавить(СуммаПродаж);
	РазделыПоУмолчанию.Добавить(ОстаткиДСККМ);
	РазделыПоУмолчанию.Добавить(ОстаткиДС);
	РазделыПоУмолчанию.Добавить(ПродажиПоКонтрагентам);
	РазделыПоУмолчанию.Добавить(ДвиженияДС);
	РазделыПоУмолчанию.Добавить(ЗадолженностьПоставщикам);
	
	Возврат РазделыПоУмолчанию;
	
КонецФункции



#КонецОбласти

#КонецЕсли