#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверкаЗаполнения(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаЗаполнения(Отказ)

	Если НаборКонстант.НижняяГраницаДиапазонаSKUВесовогоТовара >= НаборКонстант.ВерхняяГраницаДиапазонаSKUВесовогоТовара Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'Нижняя граница должна быть меньше верхней.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,"НаборКонстант.НижняяГраницаДиапазонаSKUВесовогоТовара");
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

