
&НаКлиенте
&Вместо("Подключаемый_ИзменитьСтроку")
Процедура nb_Подключаемый_ИзменитьСтроку()
	//ПродолжитьВызов();
КонецПроцедуры

&НаКлиенте
&Вместо("Подключаемый_УстановитьТекущийЭлемент_ТоварыКоличествоУпаковок")
Процедура nb_Подключаемый_УстановитьТекущийЭлемент_ТоварыКоличествоУпаковок()
	ТекущийЭлемент = Элементы.Товары;
	Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличествоУпаковок;
	
	//Элементы.Товары.ИзменитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура nb_КомандаDelПосле(Команда)
	

	ДанныеСтрокиТовары = Элементы.Товары.ТекущиеДанные;
	Отказ = ложь;
	
	Если ДанныеСтрокиТовары <> Неопределено Тогда
		Отказ = Ложь;
		ТоварыПередУдалениемКлиент(Отказ);
		
		Если НЕ Отказ Тогда
			Объект.Товары.Удалить(ДанныеСтрокиТовары);
			ТоварыПослеУдаленияСервер();
			ПересчитатьИлиОтменитьСкидкиИОплатуБонусами();
			ОбновитьФорму();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура nb_ДекорацияСводныйОтчетНажатиеВместо(Элемент)
	ОчиститьСообщения();
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	
	КассоваяСменаССылка = ПолучитьКассовуюСмену();
	ПараметрыФормы = Новый Структура("Ключ", КассоваяСменаССылка);
	ОткрытьФорму("Документ.КассоваяСмена.ФормаОбъекта",ПараметрыФормы,,,,,, Режим);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКассовуюСмену()
	
	КассоваяСменаССылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассоваяСмена.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ
		|	НЕ КассоваяСмена.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассоваяСмена.МоментВремени УБЫВ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КассоваяСменаССылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат КассоваяСменаССылка

КонецФункции // ПолучитьКассовуюСмену()

&НаКлиенте
&После("ДисконтнаяКартаПриИзменении")
Процедура nb_ДисконтнаяКартаПриИзменении()
	СтруктураПараметрыФормы = Новый Структура("ВладелецДисконтнойКарты, ДисконтнаяКарта");
	ЗаполнитьЗначенияСвойств(СтруктураПараметрыФормы, Объект);
	ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.nb_ФормаКлиента",СтруктураПараметрыФормы,ЭтаФорма);
КонецПроцедуры
