#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя") Тогда
		
		Элементы.ИнтервалПроверкиНапоминаний.Видимость = Ложь;
		Элементы.Декорация4.Видимость = Ложь;
		
	КонецЕсли;
	
	// БазоваяФункциональность
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	// Конец БазоваяФункциональность
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	ИнтервалПроверкиНапоминаний = ПараметрыРаботыКлиента.НастройкиНапоминаний.ИнтервалПроверкиНапоминаний;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнтервалПроверкиНапоминанийПриИзменении(Элемент)
	ИнтервалПроверкиНапоминанийПриИзмененииСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменениеПароляПользователя(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.ИзменениеПароляПользователяИБ.Форма.ФормаСменыПароля.Открытие");
             
	ОткрытьФорму("Обработка.ИзменениеПароляПользователяИБ.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеНастройкиРаботыСФайлами(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "ОбщаяФорма.ПерсональныеНастройкиРаботыСФайлами.Открытие");
	
	ОткрытьФорму("ОбщаяФорма.ПерсональныеНастройкиРаботыСФайлами");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональнаяНастройкаПроксиСервера(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера",
	                  Новый Структура("НастройкаПроксиНаКлиенте", Истина));
	
 КонецПроцедуры

&НаКлиенте
Процедура ИзменениеТекущегоМагазина(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.ИзменениеТекущегоМагазина.Форма.Форма.Открытие");

	ОткрытьФорму("Обработка.ИзменениеТекущегоМагазина.Форма");

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьДействиеПриВыбореМакетаПечатнойФормы(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ПользовательскиеМакетыПечати.Форма.ВыбораРежимаОткрытияМакета.Открытие");

	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.ВыбораРежимаОткрытияМакета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнтервалПроверкиНапоминанийПриИзмененииСервер()
	МассивСтруктур = Новый Массив;
	
	// НапоминанияПользователя
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиНапоминаний");
	Элемент.Вставить("Настройка", "ИнтервалПроверкиНапоминаний");
	Элемент.Вставить("Значение", ИнтервалПроверкиНапоминаний);
	МассивСтруктур.Добавить(Элемент);
	// Конец НапоминанияПользователя
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);

КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзменении(Элемент)
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзмененииНаСервере()
	
	// БазоваяФункциональность
	МассивСтруктур = Новый Массив;
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "ОбщиеНастройкиПользователя");
	Элемент.Вставить("Настройка", "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы");
	Элемент.Вставить("Значение", ЗапрашиватьПодтверждениеПриЗавершенииПрограммы);

	МассивСтруктур.Добавить(Элемент);
	// Конец БазоваяФункциональность
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти


