
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
	ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Справочник.БонусныеПрограммыЛояльности.Форма.ИспользованиеВСкидкахНаценках.Открытие");
                 
	ПараметрыФормы = Новый Структура("БонуснаяПрограммаЛояльности", ПараметрКоманды);
	ОткрытьФорму("Справочник.БонусныеПрограммыЛояльности.Форма.ИспользованиеВСкидкахНаценках",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
