#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                                  Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка",                                  Реквизиты.Ссылка);
	Запрос.Текст = 
	"//0 ТаблицаТоварыНаСкладах
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Количество               КАК Количество,
	|   ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПоступлениеТоваров) КАК АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.ТоварыНаСкладах КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//1 ТаблицаДенежныеСредстваККМ
	|ВЫБРАТЬ
	|	ТаблицаДенежныеСредства.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаДенежныеСредства.Касса КАК КассаККМ,
	|	ТаблицаДенежныеСредства.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ТаблицаДенежныеСредства.Сумма КАК Сумма
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.ДенежныеСредстваККМ КАК ТаблицаДенежныеСредства
	|ГДЕ 
	|   ТаблицаДенежныеСредства.Ссылка = &Ссылка
    |
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//2 ТаблицаЦеныНоменклатуры
	|ВЫБРАТЬ
	|   &Период КАК Период,
	|   ЦеныНоменклатуры.НомерСтроки КАК НомерСтроки,
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатуры.Упаковка КАК Упаковка,
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ 
	|   ЦеныНоменклатуры.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//3 ТаблицаПродажиПоДисконтнымКартам
	|ВЫБРАТЬ
	|	ТаблицаПродажи.НомерСтроки              КАК НомерСтроки,
	|	&Период                                 КАК Период,
	|	ТаблицаПродажи.ДисконтнаяКарта          КАК ДисконтнаяКарта,
	|	ТаблицаПродажи.ВладелецДисконтнойКарты  КАК ВладелецДисконтнойКарты,
	|	ТаблицаПродажи.Сумма                    КАК Сумма
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.ПродажиПоДисконтнымКартам КАК ТаблицаПродажи
	|ГДЕ 
	|   ТаблицаПродажи.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//4 ТаблицаДенежныеСредстваНаличные
	|ВЫБРАТЬ
	|	ТаблицаДенежныеСредстваНаличные.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаДенежныеСредстваНаличные.Касса КАК Касса,
	|	ТаблицаДенежныеСредстваНаличные.Сумма КАК Сумма,
	|	ТаблицаДенежныеСредстваНаличные.Магазин КАК Магазин,
	|	ТаблицаДенежныеСредстваНаличные.Организация КАК Организация,
	|	ТаблицаДенежныеСредстваНаличные.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.ДенежныеСредстваНаличные КАК ТаблицаДенежныеСредстваНаличные
	|ГДЕ 
	|   ТаблицаДенежныеСредстваНаличные.Ссылка = &Ссылка
    |
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//5 ТаблицаТоварыОрганизаций
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	ТаблицаТовары.Организация              КАК Организация,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Количество               КАК Количество
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.ТоварыОрганизаций КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//6 ТаблицаКвотыАссортимента
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	НАЧАЛОПЕРИОДА(ТаблицаТовары.ДатаНачалаДействия, МЕСЯЦ) КАК Период,
	|	ТаблицаТовары.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ТаблицаТовары.ОбъектПланирования КАК ОбъектПланирования,
	|	ТаблицаТовары.Марка КАК Марка,
	|	ТаблицаТовары.Квота КАК Квота,
	|	ТаблицаТовары.ПроцентОтклонения КАК ПроцентОтклонения
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.КвотыАссортимента КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//7 ТаблицаАссортимент
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
    |	&Период КАК Период,
    |	ТаблицаТовары.Номенклатура КАК Номенклатура,
    |	ТаблицаТовары.ОбъектПланирования КАК ОбъектПланирования,
    |	ТаблицаТовары.РольАссортимента КАК РольАссортимента,
    |	ТаблицаТовары.РазрешеныЗакупки КАК РазрешеныЗакупки,
    |	ТаблицаТовары.РазрешеныПродажи КАК РазрешеныПродажи,
    |	ТаблицаТовары.ВидЦен КАК ВидЦен
	|ИЗ
	|	Документ.УдалитьСверткаИзУправляющейСистемы.Ассортимент КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////";
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыНаСкладах"          ,Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваККМ"      ,Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры"         ,Результат[2].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаПродажиПоДисконтнымКартам",Результат[3].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаличные" ,Результат[4].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыОрганизаций"        ,Результат[5].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаКвотыАссортимента"		  ,Результат[6].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаАссортимент"        	  ,Результат[7].Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Сверка остатков по товарам
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СверкаТоваров";
	КомандаПечати.Представление = НСтр("ru = 'Сверка остатков по товарам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("Представление", КомандаПечати.Представление);
	КомандаПечати.Порядок = 65;
	
	// Сверка остатков денежных средств.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СверкаДенежныхСредств";
	КомандаПечати.Представление = НСтр("ru = 'Сверка остатков денежных средств'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("Представление", КомандаПечати.Представление);
	КомандаПечати.Порядок = 65;
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СверкаТоваров") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СверкаТоваров", 
			ПараметрыПечати.Представление,
			ПечатьСверкаТоваров(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СверкаДенежныхСредств") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СверкаДенежныхСредств",
			ПараметрыПечати.Представление,
			ПечатьСверкаДенежныхСредств(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует печатную форму документа.
//
Функция ПечатьСверкаТоваров(МассивОбъектов, ОбъектыПечати)
	
	Возврат Новый ТабличныйДокумент;
	
КонецФункции

// Функция формирует печатную форму документа.
//
Функция ПечатьСверкаДенежныхСредств(МассивОбъектов, ОбъектыПечати)
	
	Возврат Новый ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
