
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПечатьПослеЗакрытия")
		И Параметры.ПечатьПослеЗакрытия Тогда
		
		ПечатьПослеЗакрытия = Параметры.ПечатьПослеЗакрытия;
		СсылкиНаДокументы = Параметры.СсылкиНаДокументы;
		Если СсылкиНаДокументы.Количество() > 0 Тогда
			Объект.Документ = СсылкиНаДокументы[0];
			Элементы.Документ.ТолькоПросмотр = Истина;
		КонецЕсли;
		Если Параметры.Свойство("ДополнительныеПараметры") Тогда
			ПараметрыПечати = Параметры.ДополнительныеПараметры;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("Документ") Тогда
		Объект.Документ = Параметры.Документ;
	КонецЕсли;
	Если Параметры.Свойство("Редактирование") Тогда
		Элементы.ФормаКнопкаПечатьТТН.Видимость = Ложь;
		Элементы.ФормаСохранить.Видимость = Истина;
		Элементы.ФормаСохранить.КнопкаПоУмолчанию = Истина;
		Элементы.Документ.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаКнопкаПечатьТТН.Видимость = Истина;
		Элементы.ФормаСохранить.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтключитьОтметкуНезаполненного();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ЗаполнитьПоДокументу();	
	ОтключитьОтметкуНезаполненного();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаАвтомобиляПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерАвтомобиляПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МаркаПрицепаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерПрицепаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВодительскоеУдостоверениеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПунктПогрузкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПунктРазгрузкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СрокДоставкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЛицензионнаяКарточкаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьТТН(Команда)
	
	Если НЕ ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда
		ПараметрыПечати = Новый Структура;
	КонецЕсли;
	ПараметрыПечати.Вставить("СрокДоставки", Объект.СрокДоставки);
	ПараметрыПечати.Вставить("МаркаАвтомобиля", Объект.МаркаАвтомобиля);
	ПараметрыПечати.Вставить("МаркаПрицепа", Объект.МаркаПрицепа);
	ПараметрыПечати.Вставить("ГосНомерАвтомобиля", Объект.ГосНомерАвтомобиля);
	ПараметрыПечати.Вставить("ГосНомерПрицепа", Объект.ГосНомерПрицепа);
	ПараметрыПечати.Вставить("ПунктПогрузки", Объект.ПунктПогрузки);
	ПараметрыПечати.Вставить("ПунктРазгрузки", Объект.ПунктРазгрузки);
	ПараметрыПечати.Вставить("Водитель", Объект.Водитель);
	ПараметрыПечати.Вставить("Перевозчик", Объект.Перевозчик);
	ПараметрыПечати.Вставить("Заказчик", Объект.Заказчик);
	ПараметрыПечати.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	ПараметрыПечати.Вставить("ЛицензионнаяКарточка", ?(Объект.ЛицензионнаяКарточка, "Стандартная", "Ограниченная"));
	ПараметрыПечати.Вставить("ВодительскоеУдостоверение", Объект.ВодительскоеУдостоверение);
	ПараметрыПечати.Вставить("Представление", НСтр("ru = '1-Т (Товарно - транспортная накладная)'"));
	
	Если Модифицированность Тогда
		СохранитьВДокумент();
	КонецЕсли;
	
	Если ПечатьПослеЗакрытия Тогда
		Закрыть(ПараметрыПечати);
	Иначе
		ИмяМенеджераПечати = ?(ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.ПеремещениеТоваров"),"Документ.ПеремещениеТоваров","Документ.РеализацияТоваров");
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Объект.Документ);
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяМенеджераПечати,
				"ТТН",
				МассивДокументов,
				ЭтаФорма,
				ПараметрыПечати);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СрокДоставки", Объект.СрокДоставки);
	СтруктураРеквизитов.Вставить("МаркаАвтомобиля", СокрЛП(Объект.МаркаАвтомобиля));
	СтруктураРеквизитов.Вставить("МаркаПрицепа", СокрЛП(Объект.МаркаПрицепа));
	СтруктураРеквизитов.Вставить("ГосНомерАвтомобиля", СокрЛП(Объект.ГосНомерАвтомобиля));
	СтруктураРеквизитов.Вставить("ГосНомерПрицепа", СокрЛП(Объект.ГосНомерПрицепа));
	СтруктураРеквизитов.Вставить("ПунктПогрузки", СокрЛП(Объект.ПунктПогрузки));
	СтруктураРеквизитов.Вставить("ПунктРазгрузки", СокрЛП(Объект.ПунктРазгрузки));
	СтруктураРеквизитов.Вставить("Водитель", СокрЛП(Объект.Водитель));
	СтруктураРеквизитов.Вставить("Перевозчик", СокрЛП(Объект.Перевозчик));
	СтруктураРеквизитов.Вставить("Заказчик", СокрЛП(Объект.Заказчик));
	СтруктураРеквизитов.Вставить("ВидПеревозки", СокрЛП(Объект.ВидПеревозки));
	СтруктураРеквизитов.Вставить("ЛицензионнаяКарточка", ?(Объект.ЛицензионнаяКарточка, "Стандартная", "Ограниченная"));
	СтруктураРеквизитов.Вставить("ВодительскоеУдостоверение", СокрЛП(Объект.ВодительскоеУдостоверение));
	Закрыть(СтруктураРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоДокументу()
	
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		ДанныеТранспортногоРаздела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Документ, "ДанныеТранспортногоРаздела");
		Если ДанныеТранспортногоРаздела <> Неопределено Тогда
			СтруктураРеквизитов = ДанныеТранспортногоРаздела.Получить();
			Если ТипЗнч(СтруктураРеквизитов) = Тип("Структура") Тогда
				Если СтруктураРеквизитов.Свойство("СрокДоставки") Тогда
					Объект.СрокДоставки = СтруктураРеквизитов.СрокДоставки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("МаркаАвтомобиля") Тогда
					Объект.МаркаАвтомобиля = СтруктураРеквизитов.МаркаАвтомобиля;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("МаркаПрицепа") Тогда
					Объект.МаркаПрицепа = СтруктураРеквизитов.МаркаПрицепа;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ГосНомерАвтомобиля") Тогда
					Объект.ГосНомерАвтомобиля = СтруктураРеквизитов.ГосНомерАвтомобиля;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ГосНомерПрицепа") Тогда
					Объект.ГосНомерПрицепа = СтруктураРеквизитов.ГосНомерПрицепа;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ПунктПогрузки") Тогда
					Объект.ПунктПогрузки = СтруктураРеквизитов.ПунктПогрузки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ПунктРазгрузки") Тогда
					Объект.ПунктРазгрузки = СтруктураРеквизитов.ПунктРазгрузки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("Водитель") Тогда
					Объект.Водитель = СтруктураРеквизитов.Водитель;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("Перевозчик") Тогда
					Объект.Перевозчик = СтруктураРеквизитов.Перевозчик;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("Заказчик") Тогда
					Объект.Заказчик = СтруктураРеквизитов.Заказчик;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ВидПеревозки") Тогда
					Объект.ВидПеревозки = СтруктураРеквизитов.ВидПеревозки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ЛицензионнаяКарточка") Тогда
					Если СтруктураРеквизитов.ЛицензионнаяКарточка = "Стандартная" Тогда
						Объект.ЛицензионнаяКарточка = Истина;
					Иначе
						Объект.ЛицензионнаяКарточка = Ложь;
					КонецЕсли;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ВодительскоеУдостоверение") Тогда
					Объект.ВодительскоеУдостоверение = СтруктураРеквизитов.ВодительскоеУдостоверение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВДокумент()
	
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		ДокументОбъект = Объект.Документ.ПолучитьОбъект();
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("СрокДоставки", Объект.СрокДоставки);
		СтруктураРеквизитов.Вставить("МаркаАвтомобиля", СокрЛП(Объект.МаркаАвтомобиля));
		СтруктураРеквизитов.Вставить("МаркаПрицепа", СокрЛП(Объект.МаркаПрицепа));
		СтруктураРеквизитов.Вставить("ГосНомерАвтомобиля", СокрЛП(Объект.ГосНомерАвтомобиля));
		СтруктураРеквизитов.Вставить("ГосНомерПрицепа", СокрЛП(Объект.ГосНомерПрицепа));
		СтруктураРеквизитов.Вставить("ПунктПогрузки", СокрЛП(Объект.ПунктПогрузки));
		СтруктураРеквизитов.Вставить("ПунктРазгрузки", СокрЛП(Объект.ПунктРазгрузки));
		СтруктураРеквизитов.Вставить("Водитель", СокрЛП(Объект.Водитель));
		СтруктураРеквизитов.Вставить("Перевозчик", СокрЛП(Объект.Перевозчик));
		СтруктураРеквизитов.Вставить("Заказчик", СокрЛП(Объект.Заказчик));
		СтруктураРеквизитов.Вставить("ВидПеревозки", СокрЛП(Объект.ВидПеревозки));
		СтруктураРеквизитов.Вставить("ЛицензионнаяКарточка", ?(Объект.ЛицензионнаяКарточка, "Стандартная", "Ограниченная"));
		СтруктураРеквизитов.Вставить("ВодительскоеУдостоверение", СокрЛП(Объект.ВодительскоеУдостоверение));
		
		ДокументОбъект.ДанныеТранспортногоРаздела = Новый ХранилищеЗначения(СтруктураРеквизитов);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
