#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныСписанияТоварныеГруппы");
	НастройкиВарианта.Описание = НСтр("ru='Анализ списаний товаров в разрезе товарных групп'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныСписанияМагазины");
	НастройкиВарианта.Описание = НСтр("ru='Анализ списаний товаров в разрезе магазинов'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныСписанияДетальный");
	НастройкиВарианта.Описание = НСтр("ru='Анализ списаний товаров в разрезе номенклатурных позиций'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПричиныСписанияТоварныеКатегории");
	НастройкиВарианта.Описание = НСтр("ru='Анализ списаний товаров в разрезе товарных категорий'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныСписания, "ПричиныСписанияТоварныеКатегории");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Склад.Подсистемы.СкладскиеОперации);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныСписания, "ПричиныСписанияТоварныеГруппы");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныСписания, "ПричиныСписанияМагазины");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПричиныСписания, "ПричиныСписанияДетальный");
	Вариант.Размещение.Удалить(Метаданные.Подсистемы.Маркетинг.Подсистемы.Ассортимент.Подсистемы.ДополнительныеОтчетыПоАнализуАссортимента);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
