#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// &ЗамерПроизводительности
	ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Обработка.ПовторнаяАктивацияПодарочныхСертификатов.Форма.Форма.Открытие");

	ПараметрыФормы = Новый Структура("МассивСертификатов", ПараметрКоманды);
	ОткрытьФорму("Обработка.ПовторнаяАктивацияПодарочныхСертификатов.Форма",
					ПараметрыФормы,
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Уникальность,
					ПараметрыВыполненияКоманды.Окно,
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти