#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
// 		Возвращаемое значение:
// 		Массив - имена блокируемых реквизитов.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ВалютаПредоставления");
	Результат.Добавить("ВариантСовместногоПрименения");
	Результат.Добавить("РеквизитДопУпорядочивания");
	Результат.Добавить("СтатусДействия");
	Результат.Добавить("ВидЦены");
	Результат.Добавить("ЗначениеСкидкиНаценки");
	Результат.Добавить("ОбластьПредоставления");
	Результат.Добавить("СегментНоменклатурыПредоставления");
	Результат.Добавить("СпособПредоставления");
	Результат.Добавить("Управляемая");
	Результат.Добавить("УсловияПредоставления; УсловияПредоставленияПодобратьУсловияПредоставления");
	Результат.Добавить("ЦеновыеГруппы");
	Результат.Добавить("Родитель");
	Результат.Добавить("ПодарокИзСписка");
	Результат.Добавить("ПодарокИзКорзиныПокупателя");
	Результат.Добавить("КоличествоПодарковИзКорзиныПокупателя");
	Результат.Добавить("УчитыватьПодарокКакПродажу");
	Результат.Добавить("НаборПодарков");
	Результат.Добавить("ТекстСообщения");
	Результат.Добавить("МоментВыдачиСообщения");
	Результат.Добавить("БонуснаяПрограммаЛояльности");
	Результат.Добавить("ПериодДействия;ГруппаСрокДействия");
	Результат.Добавить("КоличествоПериодовДействия");
	Результат.Добавить("ПериодОтсрочкиНачалаДействия;ГруппаОтсрочкаНачалаДействия");
	Результат.Добавить("КоличествоПериодовОтсрочкиНачалаДействия");
	Результат.Добавить("КратноКоличествуУсловий");
	Результат.Добавить("ОграничениеРазмераПодчиненныхСкидок");
	Результат.Добавить("ВнешняяОбработка;ГруппаНастройкаВнешнейОбработки");
	
	Возврат Результат;
	
КонецФункции

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("Управляемая");
	РедактируемыеРеквизиты.Добавить("СтатусДействия");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
