////////////////////////////////////////////////////////////////////////////////
// ДокументыФизическихЛицКлиентСервер. Содержит вспомогательные процедуры 
//  обработки документов физических лиц.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает структуру документа удостоверяющего личность
Функция СтруктураДокументаУдостоверяющегоЛичность(Физлицо, Дата = Неопределено) Экспорт
	
	Возврат ДокументыФизическихЛиц.СтруктураДокументаУдостоверяющегоЛичность(Физлицо, Дата);
	
КонецФункции


#КонецОбласти

