#Область ПрограммныйИнтерфейс

// Обновляет наборы свойств. 
//
// Параметры:
//	ПутьКДанным - Строка - содержит путь к параметру именования.
//	НаборыСвойств - СписокЗначений - содержит наборы свойств дополнительных реквизитов и сведений, по которым формируется дерево конструктора правила именования.
//	ТаблицаДоступныхПараметров - ДанныеФормыКоллекция - таблица, которая содержит параметры, по которым строится правило именования номенклатуры.
//
Процедура ОбновитьНаборыСвойств(ПутьКДанным,НаборыСвойств,ТаблицаДоступныхПараметров) Экспорт
		
	РаботаСПравиламиИменованияКлиентСервер.ОбновитьНаборыСвойств(ПутьКДанным,НаборыСвойств,ТаблицаДоступныхПараметров);
	
КонецПроцедуры

// Возвращает заполненную структуру правила именования.
//
// Параметры:
//	Правило - Строка - содержит правило именования.
//	НаборыСвойств - СписокЗначений - содержит наборы свойств дополнительных реквизитов и сведений, по которым формируется дерево конструктора правила именования.
//	ТаблицаДоступныхПараметров - ДанныеФормыКоллекция - таблица, которая содержит параметры, по которым строится правило именования номенклатуры.
//
Функция ПолучитьСтруктуруПравилаИменования(Правило,НаборыСвойств,ТаблицаДоступныхПараметров) Экспорт
		
	Возврат РаботаСПравиламиИменованияКлиентСервер.ПолучитьСтруктуруПравилаИменования(Правило,НаборыСвойств,ТаблицаДоступныхПараметров);

КонецФункции

// Преобразует путь к данным параметра в строку для вставки в формулу.
//
Функция ПолучитьТекстДляВставкиПараметра(ПутьКДанным) Экспорт
	
	Возврат "[" + ПутьКДанным + "]";
	
КонецФункции

// Открывает форму поиска номенклатуры по наименованию.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма, в которой инициируется поиск по наименованию.
//	ПараметрыПоиска - Структура - параметры открытия формы поиска.
//	ЭтоФормаРМК - Булево - истина, если поиск осуществляется из РМК.
//
Процедура ПоискПоНаименованию(Форма, ПараметрыПоиска, ЭтоФормаРМК = Ложь) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеПоискаПоНаименованию",Форма);
	Если ЭтоФормаРМК Тогда
		ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ФормаПоискаПоНаименованию",ПараметрыПоиска,Форма,,,,Оповещение);
	Иначе
		ОткрытьФорму("Обработка.РаботаСПравиламиИменованияНоменклатуры.Форма.ПоискНоменклатуры",ПараметрыПоиска,Форма,,,,Оповещение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
