#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОбщегоНазначенияРТ.ВывестиДатуФормированияОтчета(ДокументРезультат);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	|ГДЕ 
	|	ГруппыДоступаЗначенияДоступа.Ссылка.Пользователи.Пользователь = &Пользователь
	|И
	|	ТИПЗНАЧЕНИЯ(ГруппыДоступаЗначенияДоступа.ЗначениеДоступа) = ТИП(Справочник.Магазины)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрофилиГруппДоступаЗначенияДоступа.ЗначениеДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.ЗначенияДоступа КАК ПрофилиГруппДоступаЗначенияДоступа
	|		ПО ГруппыДоступа.Профиль.Ссылка = ПрофилиГруппДоступаЗначенияДоступа.Ссылка
	|ГДЕ
	|	ГруппыДоступа.Пользователи.Пользователь = &Пользователь
	|И
	|	ТИПЗНАЧЕНИЯ(ПрофилиГруппДоступаЗначенияДоступа.ЗначениеДоступа) = ТИП(Справочник.Магазины)");
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		ВывестиНадписьОграниченияДоступа(ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиНадписьОграниченияДоступа(ДокументРезультат)
	
	ДокументРезультат.Область("R1C1").Текст = НСтр("ru = 'Внимание. Отображаются данные только по доступным магазинам.'");
	ДокументРезультат.Область("R1C1").ЦветТекста = WebЦвета.Кирпичный;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
