#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает статью движения денежных средств для выбранной хозяйственной операции.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа для которой
//	                                                                   получаем статью движения денежных средств.
//
// Возвращаемое значение:
// 	СправочникСсылка.СтатьиДвиженияДенежныхСредств - Найденная статья ДДС.
//
Функция СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ХозяйственнаяОперация) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	НЕ СтатьиДвиженияДенежныхСредств.ПометкаУдаления
	|	И СтатьиДвиженияДенежныхСредств.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
	Иначе
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтатьяДвиженияДенежныхСредств;

КонецФункции

// Заполняет хозяйственную операцию для предопределенных элементов статей денежных средств.
//
Процедура ЗаполнитьХозяйственнуюОперациюПредопределеннымСтатьямДДС() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюКассу,
		Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеДенежныхСредствИзБанка,
		Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.СдачаДенежныхСредствВБанк,
		Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюОрганизацию,
		Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюОрганизацию);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВКассуККМ,
		Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеДенежныхСредствИзКассыККМ,
		Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплатыСотрудникам,
		Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыПоВедомостям);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплатыСотруднику,
		Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыРаботнику);
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВнутренняяПередачаДенежныхСредств,
		Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
	
	Для Каждого Элемент Из Соответствие Цикл
		
		СтатьяДДСОбъект = Элемент.Ключ.ПолучитьОбъект();
		СтатьяДДСОбъект.ХозяйственнаяОперация = Элемент.Значение;
		СтатьяДДСОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Получает предопределенную статью движения денежных средств для выбранной хозяйственной операции.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
//
// Возвращаемое значение:
// 	СправочникСсылка.СтатьиДвиженияДенежныхСредств - Предопределенная статья ДДС.
//
Функция ПредопределеннаяСтатьяДДСПоХозяйственнойОперации(ХозяйственнаяОперация) Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюКассу);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюОрганизацию,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюОрганизацию);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюКассу);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка,
		Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеДенежныхСредствИзБанка);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюКассу);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюОрганизацию);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюКассу);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк,
		Справочники.СтатьиДвиженияДенежныхСредств.СдачаДенежныхСредствВБанк);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВКассуККМ);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ,
		Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеДенежныхСредствИзКассыККМ);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыПоВедомостям,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплатыСотрудникам);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыРаботнику,
		Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплатыСотрудникам);
		
	Соответствие.Вставить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств,
		Справочники.СтатьиДвиженияДенежныхСредств.ВнутренняяПередачаДенежныхСредств);
		
	СтатьяДвиженияДенежныхСредств = Соответствие.Получить(ХозяйственнаяОперация);
		
	Если СтатьяДвиженияДенежныхСредств = Неопределено Тогда
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтатьяДвиженияДенежныхСредств;
	
КонецФункции

// Получает хозяйственную операцию на предопределенную статью ДДС.
//
Функция ХозяйственнаяОперацияПредопределеннойСтатьиДДС(ПредопределеннаяСтатья) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюКассу,
		Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеДенежныхСредствИзБанка,
		Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.СдачаДенежныхСредствВБанк,
		Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВДругуюОрганизацию,
		Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюОрганизацию);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыдачаДенежныхСредствВКассуККМ,
		Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеДенежныхСредствИзКассыККМ,
		Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплатыСотрудникам,
		Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыПоВедомостям);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплатыСотруднику,
		Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыРаботнику);
		
	Соответствие.Вставить(Справочники.СтатьиДвиженияДенежныхСредств.ВнутренняяПередачаДенежныхСредств,
		Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
	
	ХозяйственнаяОперация = Соответствие.Получить(ПредопределеннаяСтатья);
	
	Если ХозяйственнаяОперация = Неопределено Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПустаяСсылка();;
	КонецЕсли;
	
	Возврат ХозяйственнаяОперация;
	
КонецФункции

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
//
// Возвращаемое значение:
//	Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("ХозяйственнаяОперация");
	Возврат Результат;
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
