#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	
	
КонецПроцедуры

Функция НастройкиРаспределения(ВариантРаспределения, Магазин = Неопределено) Экспорт
	
	ИндивидуальныеНастройкиДляМагазинов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантРаспределения, "ИндивидуальныеНастройкиДляМагазинов");
	
	Если ИндивидуальныеНастройкиДляМагазинов и не ТипЗнч(Магазин) = Тип("СправочникСсылка.Магазины") Тогда
		ОписаниеОшибки = НСтр("ru = 'Для варианта распределения %1 необходимо указать магазин'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ВариантРаспределения);
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиВариантовРаспределенияТоваров.НастройкиВарианта КАК НастройкиВарианта
	|ИЗ
	|	РегистрСведений.НастройкиВариантовРаспределенияТоваров КАК НастройкиВариантовРаспределенияТоваров
	|ГДЕ
	|	НастройкиВариантовРаспределенияТоваров.ВариантРаспределенияТоваров = &ВариантРаспределения";
	Запрос.УстановитьПараметр("ВариантРаспределения", ВариантРаспределения);
	
	Если ИндивидуальныеНастройкиДляМагазинов Тогда
		Запрос.Текст = Запрос.Текст + " И НастройкиВариантовРаспределенияТоваров.Магазин = &Магазин";
		Запрос.УстановитьПараметр("Магазин", Магазин);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.НастройкиВарианта.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьРаспределениеТоваров(Магазин, ВариантРаспределения, ТоварыФакт, СерийныеНомераФакт, ТоварыПеремещение, СерийныеНомераПеремещение, ФормаРаспределения, НастройкиВарианта = Неопределено, ИдентификаторыВыделенныхСтрок) Экспорт
	
	Если НастройкиВарианта = Неопределено Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.НастройкиВарианта КАК НастройкиВарианта
		|ИЗ
		|	РегистрСведений.НастройкиВариантовРаспределенияТоваров КАК Настройки
		|ГДЕ
		|	Настройки.ВариантРаспределенияТоваров = &ВариантРаспределенияТоваров
		|	И (Настройки.Магазин = &Магазин
		|			ИЛИ не Настройки.ВариантРаспределенияТоваров.ИндивидуальныеНастройкиДляМагазинов)";
		Запрос.УстановитьПараметр("ВариантРаспределенияТоваров", ВариантРаспределения);
		Запрос.УстановитьПараметр("Магазин", Магазин);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			НастройкиВарианта = Результат.НастройкиВарианта;
		Иначе
			ТекстОшибки = НСтр("ru = 'При чтении настроек распределения произошла ошибка, выполнение распределения невозможно. Обратитесь к Администратору'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	ВнешняяОбработка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантРаспределения, "ВнешняяОбработка");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ВнешняяОбработка);
	ВнешняяОбработкаОбъект.ВыполнитьРаспределение(ТоварыФакт, СерийныеНомераФакт, ТоварыПеремещение, СерийныеНомераПеремещение, НастройкиВарианта, ИдентификаторыВыделенныхСтрок, ФормаРаспределения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
