
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.НастройкаРаспределенияТоваровПоСкладамИОрганизациям.Форма.Форма.Открытие");

	ПараметрыФормы = Новый Структура("Режим, ЗапретитьИзменениеРежима, Магазин, ЗапретитьИзменениеМагазина", "РаспределениеРеализацииУслуг", Истина, ПараметрКоманды, Истина);
	ОткрытьФорму("Обработка.НастройкаРаспределенияТоваровПоСкладамИОрганизациям.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры
