#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает реквизиты объекта, которые необходимо блокировать от изменения.
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Массив - блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("КурсКонвертацииБонусовВВалюту");
	Результат.Добавить("МаксимальныйПроцентОплатыБонусами");
	Результат.Добавить("ВалютаКонвертацииБонусов");
	Результат.Добавить("ЗапретНачисленияБалловПриОплатеБонусами");
	Результат.Добавить("СегментНоменклатуры");
	Результат.Добавить("ЦеновыеГруппы");
	Результат.Добавить("ВидОплаты");
	Результат.Добавить("УменьшатьСуммуЧекаДляСкидок");
	
	Возврат Результат;

КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли