
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.КонтрольПримененияЦенНоменклатуры.Форма.Форма.Открытие");
    
    ОткрытьФорму("Обработка.КонтрольПримененияЦенНоменклатуры.Форма", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
    
КонецПроцедуры

#КонецОбласти
