#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует текст запроса к сведениям физических лиц.
// Возвращаемое значение:
// 		ТекстЗапроса - Строка. Содержит текст запроса.
Функция ТекстЗапросаДляЗаполненияРассылки() Экспорт
	
	ТекстЗапроса = "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.Контакт КАК Контакт,
	|	ЕСТЬNULL(МАКСИМУМ(Подзапрос.Фамилия), """") КАК Фамилия,
	|	ЕСТЬNULL(МАКСИМУМ(Подзапрос.Имя), """") + &Пробел + ЕСТЬNULL(МАКСИМУМ(Подзапрос.Отчество), """") КАК ПредставлениеКонтакта,
	|	ЕСТЬNULL(МАКСИМУМ(Подзапрос.АдресЭП), """") КАК АдресEMailДляОтправки,
	|	ЕСТЬNULL(МАКСИМУМ(Подзапрос.НомерТелефона), """") КАК НомерДляОтправки,
	|	ЕСТЬNULL(МАКСИМУМ(Подзапрос.Представление), """") КАК НомерТелефона
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставГруппы.Получатель КАК Контакт,
	|		"""" КАК Фамилия,
	|		"""" КАК Имя,
	|		"""" КАК Отчество,
	|		ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|		"""" КАК НомерТелефона,
	|		"""" КАК Представление
	|	ИЗ
	|		СоставГруппы КАК СоставГруппы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|			ПО СоставГруппы.Получатель = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|				И (ФизическиеЛицаКонтактнаяИнформация.Тип = &АдресЭлектроннойПочты)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СоставГруппы.Получатель,
	|		"""",
	|		"""",
	|		"""",
	|		"""",
	|		ФизическиеЛицаКонтактнаяИнформация.НомерТелефона,
	|		ФизическиеЛицаКонтактнаяИнформация.Представление
	|	ИЗ
	|		СоставГруппы КАК СоставГруппы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|			ПО СоставГруппы.Получатель = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|				И (ФизическиеЛицаКонтактнаяИнформация.Тип = &Телефон)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СоставГруппы.Получатель,
	|		ФИОФизЛицСрезПоследних.Фамилия,
	|		ФИОФизЛицСрезПоследних.Имя,
	|		ФИОФизЛицСрезПоследних.Отчество,
	|		"""",
	|		"""",
	|		""""
	|	ИЗ
	|		СоставГруппы КАК СоставГруппы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|			ПО СоставГруппы.Получатель = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Контакт";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

