////////////////////////////////////////////////////////////////////////////////
// КОД ПРОЦЕДУР И ФУНКЦИЙ модуля ДатыЗапретаИзмененияПереопределяемый.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	
	// УчетПоМагазинам
	
	// Документы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковДенежныхСредств", "Дата", "УчетПоМагазинам", "Касса.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковРасчетовСКлиентами", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВнесениеДенежныхСредствВКассуККМ", "Дата", "УчетПоМагазинам", "КассаККМ.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковРасчетовСПоставщиками", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратТоваровОтПокупателя", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратТоваровПоставщику", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыемкаДенежныхСредствИзКассыККМ", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЕжедневныйОтчет", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказНаПеремещение", "Дата", "УчетПоМагазинам", "МагазинПолучатель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказНаПеремещение", "Дата", "УчетПоМагазинам", "МагазинОтправитель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПокупателя", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаменаДисконтныхКарт", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗарплатаКВыплатеОрганизаций", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаРасходованиеДенежныхСредств", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПересчетТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассоваяСмена", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МаркетинговаяАкция", "Дата", "УчетПоМагазинам", "Магазины.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МаркетинговаяАкция", "Дата", "УчетПоМагазинам", "СкидкиНаценки.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОплатаОтПокупателяПлатежнойКартой", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаОтражениеИзлишковТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаОтражениеНедостачТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаПеремещениеТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетОРозничныхПродажах", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаТоваровМеждуОрганизациями", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеТоваров", "Дата", "УчетПоМагазинам", "МагазинПолучатель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеТоваров", "Дата", "УчетПоМагазинам", "МагазинОтправитель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПересортицаТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеИнвентаризацииТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрименениеЦенНоменклатуры", "Дата", "УчетПоМагазинам", "ОбъектЦенообразования");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "Касса.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "КассаККМ.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйОрдерНаТовары", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "Касса.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "КассаККМ.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйОрдерНаТовары", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеализацияТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияБезналичнойОплаты", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияПодсчетаПосетителей", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СборкаТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СводныйОтчетПоКассовойСмене", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеТоваров", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаСебестоимости", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЧекККМ", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоложениеОПремировании", "Дата", "УчетПоМагазинам", "Магазины.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоложениеОПремировании", "Дата", "УчетПоМагазинам", "ПравилаРасчетаПремий.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасчетПремийПоЛичнымПродажам", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ТабельУчетаРабочегоВремени", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктОРасхожденияхПриПриемкеТоваров", "Дата", "УчетПоМагазинам", "МагазинПолучатель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктОРасхожденияхПриПриемкеТоваров", "Дата", "УчетПоМагазинам", "МагазинОтправитель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаПлощадиВыкладки", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МаркировкаТоваровГИСМ", "Дата", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремаркировкаТоваровГИСМ", "Дата", "УчетПоМагазинам", "Магазин");
	
	// РегистрыСведений
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДвиженияСерийныхНомеров", "Период", "УчетПоМагазинам", "Отправитель.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДействиеСкидокНаценок", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДействующиеЦеныНоменклатуры", "Период", "УчетПоМагазинам", "ОбъектЦенообразования");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПланируемоеРабочееВремяСотрудников", "Период", "УчетПоМагазинам", "ИнтервалРаботыМагазинов.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СебестоимостьНоменклатуры", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДействующиеПравилаРасчетаПремий", "Период", "УчетПоМагазинам", "Магазин");
	
	// РегистрыНакопления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДвиженияСерийТоваров", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваКВыплате", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваККМ", "Период", "УчетПоМагазинам", "КассаККМ.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные", "Период", "УчетПоМагазинам", "Касса.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваНаличные", "Период", "УчетПоМагазинам", "Касса.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗаказыПокупателей", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗаказыТоваров", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗакупкиТоваров", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.Посетители", "Период", "УчетПоМагазинам", "СчетчикПодсчетаПосетителей.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.Продажи", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиПоПлатежнымКартам", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасчетыСПоставщиками", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СебестоимостьПоставкиТоваров", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыКОформлениюИзлишковНедостач", "Период", "УчетПоМагазинам", "Склад.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыКПоступлению", "Период", "УчетПоМагазинам", "Склад.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыКОтгрузке", "Период", "УчетПоМагазинам", "Склад.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыНаСкладах", "Период", "УчетПоМагазинам", "Склад.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыОрганизаций", "Период", "УчетПоМагазинам", "Склад.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПремииПоЛичнымПродажам", "Период", "УчетПоМагазинам", "МагазинРасчетаПремий");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ФактическоеРабочееВремяСотрудников", "Период", "УчетПоМагазинам", "Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасхожденияПриПриемке", "Период", "УчетПоМагазинам", "СкладПолучатель.Магазин");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасхожденияПриПриемке", "Период", "УчетПоМагазинам", "СкладОтправитель.Магазин");
	
	// ОбщийУчет
	
	// Документы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатковУзла", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковПоНакопительнымСкидкам", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаРегистров", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЦенНоменклатуры", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеАссортимента", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаКвотАссортимента", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассоваяКнига", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетФактураВыданный", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетФактураПолученный", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеИСписаниеБонусныхБаллов", "Дата", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнформационнаяРассылка", "Дата", "ОбщийУчет", "");
	
	// РегистрыСведений
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РегистрацияЗаменыКартПокупателей", "Период", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ЦеныНоменклатуры", "Период", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.Ассортимент", "Период", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КвотыАссортимента", "Период", "ОбщийУчет", "");
	
	// РегистрыНакопления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиПоДисконтнымКартам", "Период", "ОбщийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БонусныеБаллы", "Период", "ОбщийУчет", "");
	
КонецПроцедуры

#КонецОбласти