
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
		"Справочник.Организации.ФормаОбъекта",
		ПараметрыОткрытияФормы(),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыОткрытияФормы()
	
	Возврат Новый Структура("Ключ", Справочники.Организации.ОрганизацияПоУмолчанию());
	
КонецФункции

#КонецОбласти
