
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
	ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Справочник.Склады.Форма.ФормаСписка.Открытие");	
                 
	СтруктураОтбора  = Новый Структура("Магазин", ПараметрКоманды);
	ПараметрыФормы   = Новый Структура("ЗапретитьИзменениеМагазина, Отбор", Истина, СтруктураОтбора);
	ОткрытьФорму("Справочник.Склады.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
