#Область ПрограммныйИнтерфейс

Функция ВидыПодключаемыхКоманд() Экспорт
	
	Результат = Новый Массив;
	Возврат Результат;
	
КонецФункции

#Область КомандыДокументовВЕТИС

Процедура КомандыИсходящейТранспортнойОперации(Команды) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_КомандыИсходящейТранспортнойОперации(Команды);
	
КонецПроцедуры

Процедура КомандыВходящейТранспортнойОперации(Команды) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_КомандыВходящейТранспортнойОперации(Команды);
	
КонецПроцедуры

Процедура КомандыПроизводственнойОперации(Команды) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_КомандыПроизводственнойОперации(Команды);
	
КонецПроцедуры

Процедура КомандыИнвентаризацииПродукции(Команды) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_КомандыИнвентаризацииПродукции(Команды);
	
КонецПроцедуры


#КонецОбласти

#Область УправлениеВидимостьюКомандВЕТИС

Процедура УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, КомандыОбъекта) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, КомандыОбъекта);
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандВходящейТранспортнойОперации(Форма, КомандыОбъекта) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандВходящейТранспортнойОперации(Форма, КомандыОбъекта);
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандПроизводственнойОперации(Форма, КомандыОбъекта) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандПроизводственнойОперации(Форма, КомандыОбъекта);
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, КомандыОбъекта) Экспорт
	
	ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, КомандыОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ИнтеграцияВЕТИСРТКлиентСервер

Процедура ИнтеграцияВЕТИСРТКлиентСервер_КомандыИсходящейТранспортнойОперации(Команды) Экспорт 
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"РеализацияТоваров", НСтр("ru = 'Реализацию товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратТоваровПоставщику", НСтр("ru = 'Возврат товаров поставщику'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПеремещениеТоваров",                НСтр("ru = 'Перемещение товаров'"),);
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПередачаТоваровМеждуОрганизациями", НСтр("ru = 'Передачу товаров между организациями'"), "ИспользоватьПередачиТоваровМеждуОрганизациями");
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"РеализацияТоваров", НСтр("ru = 'Реализацию товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровПоставщику", НСтр("ru = 'Возврат товаров поставщику'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеТоваров", НСтр("ru = 'Перемещение товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПередачаТоваровМеждуОрганизациями", НСтр("ru = 'Передачу товаров между организациями'"), "ИспользоватьПередачиТоваровМеждуОрганизациями");
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_КомандыВходящейТранспортнойОперации(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПоступлениеТоваров", НСтр("ru = 'Поступление товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратТоваровОтПокупателя", НСтр("ru = 'Возврат товаров от покупателя'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеТоваров", НСтр("ru = 'Поступление товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровОтПокупателя", НСтр("ru = 'Возврат товаров от покупателя'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПередачаТоваровМеждуОрганизациями", НСтр("ru = 'Передача товаров между организациями'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеТоваров", НСтр("ru = 'Перемещение товаров'"));
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_КомандыПроизводственнойОперации(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "СборкаТоваров", НСтр("ru = 'Сборка товаров'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СборкаТоваров", НСтр("ru = 'Сборка товаров'"));
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_КомандыИнвентаризацииПродукции(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "СписаниеТоваров", НСтр("ru = 'Списание товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ОприходованиеТоваров", НСтр("ru = 'Оприходование товаров'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СписаниеТоваров", НСтр("ru = 'Списание товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОприходованиеТоваров", НСтр("ru = 'Оприходование товаров'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПересортицаТоваров", НСтр("ru = 'Пересортица товаров'"));
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, Команды) Экспорт
	
	ОднаОрганизация = (Форма.ГрузоотправительСопоставлениеХСДляОтбораОснований = Форма.ГрузополучательСопоставлениеХСДляОтбораОснований)
		И ЗначениеЗаполнено(Форма.ГрузоотправительСопоставлениеХСДляОтбораОснований);
		
	ТолькоОрганизации = ТипЗнч(Форма.ГрузополучательСопоставлениеХСДляОтбораОснований) = Тип("СправочникСсылка.Организации")
		И НЕ ОднаОрганизация;
	
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл
		
		Если КлючИЗначение.Значение.ИмяМетаданных = "ПеремещениеТоваров" 
			ИЛИ КлючИЗначение.Значение.ИмяМетаданных = "ПередачаТоваровМеждуОрганизациями"  Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ТолькоОрганизации;
		Иначе 
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ (ОднаОрганизация ИЛИ ТолькоОрганизации);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандВходящейТранспортнойОперации(Форма, Команды) Экспорт
	
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандПроизводственнойОперации(Форма, Команды) Экспорт
	
	Для Каждого Команда Из Форма.ВидимостьПодключаемыхКоманд Цикл 
		Форма.Элементы[Команда.Ключ].Видимость = НЕ ЗначениеЗаполнено(Форма.Объект.ДокументОснование);
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнтеграцияВЕТИСРТКлиентСервер_УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, Команды) Экспорт
	
	ЕстьРасход = Ложь;
	ЕстьПриход = Ложь;
	Для Каждого СтрокаТЧ Из Форма.Объект.Товары Цикл
		Если СтрокаТЧ.КоличествоИзменениеВЕТИС<0 Тогда 
			ЕстьРасход = Истина;
		ИначеЕсли СтрокаТЧ.КоличествоИзменениеВЕТИС>0 Тогда 
			ЕстьПриход = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл 
		Если КлючИЗначение.Значение.ИмяМетаданных = "ПересортицаТоваров" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ЕстьПриход = ЕстьРасход;
		ИначеЕсли КлючИЗначение.Значение.ИмяМетаданных = "ОприходованиеТоваров" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ЕстьРасход;
		Иначе
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ЕстьПриход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти