&НаСервере
Процедура УстановитьПараметрыОтчетаНаСервере()
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("КассоваяСмена") Тогда
		Отчет.КассоваяСмена = Параметры.КассоваяСмена;
		Параметры.СформироватьПриОткрытии = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура КассоваяСменаПриИзмененииНаСервере()
	//УстановитьПараметрыОтчетаНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КассоваяСменаПриИзменении(Элемент)
	КассоваяСменаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
    ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры