#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если НЕ ЕстьМагнитныеКоды ИЛИ ВыборВДокумент Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоСимволов");
		
	КонецЕсли;
	
	Если ЕстьШтрихкоды Тогда
		
		Если ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
		ИначеЕсли ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
