
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
	ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Справочник.Кассы.Форма.ФормаСписка.Открытие");

	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ЗапретитьИзменениеМагазина",       Истина);
	ПараметрыФормы.Вставить("Отбор",                            Новый Структура("Магазин", ПараметрКоманды));
	ПараметрыФормы.Вставить("ДополнительныеСкрываемыеЭлементы", Новый Структура("Магазин, ОтборМагазин"));
	
	ОткрытьФорму("Справочник.Кассы.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
