
&Вместо("ТекстЗапросаБонусы")
Функция nb_ТекстЗапросаБонусы()
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов();
	//Возврат Результат;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	&ПериодБонусов КАК Период,
	|	&Расход КАК ВидДвижения,
	|	Оплаты.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	ВЫБОР
	|		КОГДА Оплаты.ДисконтнаяКарта.КартаДляНакоплений = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка)
	|			ТОГДА Оплаты.ДисконтнаяКарта
	|		ИНАЧЕ Оплаты.ДисконтнаяКарта.КартаДляНакоплений
	|	КОНЕЦ КАК ДисконтнаяКарта,
	|	СУММА(Оплаты.КоличествоБонусовВСкидках) КАК Начислено,
	|	0 КАК КСписанию,
	|	&ПустаяДата КАК ДатаПервоначальногоНачисления
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ОплатаБонуснымиБаллами КАК Оплаты
	|ГДЕ
	|	Оплаты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.БонуснаяПрограммаЛояльности,
	|	ВЫБОР
	|		КОГДА Оплаты.ДисконтнаяКарта.КартаДляНакоплений = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка)
	|			ТОГДА Оплаты.ДисконтнаяКарта
	|		ИНАЧЕ Оплаты.ДисконтнаяКарта.КартаДляНакоплений
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Оплаты.КоличествоБонусовВСкидках) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БонусныеБаллы.ДатаНачисления КАК Период,
	|	&Приход КАК ВидДвижения,
	|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	БонусныеБаллы.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	БонусныеБаллы.nb_ОтКогоНачисленыБонусныеБаллы КАК nb_ОтКогоНачисленыБонусныеБаллы,
	|	БонусныеБаллы.КоличествоБонусныхБаллов КАК Начислено,
	|	0 КАК КСписанию,
	|	&ПустаяДата КАК ДатаПервоначальногоНачисления
	|ПОМЕСТИТЬ БонусныеБаллы
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.БонусныеБаллыКНачислению КАК БонусныеБаллы
	|ГДЕ
	|	БонусныеБаллы.Ссылка = &Ссылка
	|	И БонусныеБаллы.ДатаНачисления <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БонусныеБаллы.ДатаСписания,
	|	&Приход,
	|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
	|	БонусныеБаллы.ДисконтнаяКарта,
	|	БонусныеБаллы.nb_ОтКогоНачисленыБонусныеБаллы КАК nb_ОтКогоНачисленыБонусныеБаллы,
	|	0,
	|	БонусныеБаллы.КоличествоБонусныхБаллов,
	|	БонусныеБаллы.ДатаПервоначальногоНачисления
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.БонусныеБаллыКНачислению КАК БонусныеБаллы
	|ГДЕ
	|	БонусныеБаллы.Ссылка = &Ссылка
	|	И БонусныеБаллы.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодБонусов,
	|	&Расход,
	|	Оплаты.БонуснаяПрограммаЛояльности,
	|	Оплаты.ДисконтнаяКарта,
	|	Null,
	|	СУММА(Оплаты.КоличествоБонусовВСкидках),
	|	0,
	|	&ПустаяДата
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ОплатаБонуснымиБаллами КАК Оплаты
	|ГДЕ
	|	Оплаты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.БонуснаяПрограммаЛояльности,
	|	Оплаты.ДисконтнаяКарта
	|
	|ИМЕЮЩИЕ
	|	СУММА(Оплаты.КоличествоБонусовВСкидках) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БонусныеБаллы.Период КАК Период,
	|	БонусныеБаллы.ВидДвижения КАК ВидДвижения,
	|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	ВЫБОР
	|		КОГДА БонусныеБаллы.ДисконтнаяКарта.КартаДляНакоплений = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка)
	|			ТОГДА БонусныеБаллы.ДисконтнаяКарта
	|		ИНАЧЕ БонусныеБаллы.ДисконтнаяКарта.КартаДляНакоплений
	|	КОНЕЦ КАК ДисконтнаяКарта,
	|	БонусныеБаллы.nb_ОтКогоНачисленыБонусныеБаллы КАК nb_ОтКогоНачисленыБонусныеБаллы,
	|	СУММА(БонусныеБаллы.Начислено) КАК Начислено,
	|	СУММА(БонусныеБаллы.КСписанию) КАК КСписанию,
	|	БонусныеБаллы.ДатаПервоначальногоНачисления КАК ДатаПервоначальногоНачисления
	|ИЗ
	|	БонусныеБаллы КАК БонусныеБаллы
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеБаллы.Период,
	|	БонусныеБаллы.ВидДвижения,
	|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
	|	ВЫБОР
	|		КОГДА БонусныеБаллы.ДисконтнаяКарта.КартаДляНакоплений = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка)
	|			ТОГДА БонусныеБаллы.ДисконтнаяКарта
	|		ИНАЧЕ БонусныеБаллы.ДисконтнаяКарта.КартаДляНакоплений
	|	КОНЕЦ,
	|	БонусныеБаллы.nb_ОтКогоНачисленыБонусныеБаллы,
	|	БонусныеБаллы.ДатаПервоначальногоНачисления
	|
	|ИМЕЮЩИЕ
	|	(СУММА(БонусныеБаллы.Начислено) <> 0
	|		ИЛИ СУММА(БонусныеБаллы.КСписанию) <> 0)
	|";
	
	Возврат ТекстЗапроса;
	
	
	
	
КонецФункции
