#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(Отказ,,Запись.Организация);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.МаксимальнаяСуммаРазмена.Доступность = Запись.ТипВыемкиПриЗакрытииСмены = Перечисления.ТипыВыемкиПриЗакрытииСмены.ОставитьСуммуРазменаВКассеККМ;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипВыемкиПриЗакрытииСменыПриИзменении(Элемент)
	
	Если НЕ Запись.ТипВыемкиПриЗакрытииСмены = ПредопределенноеЗначение("Перечисление.ТипыВыемкиПриЗакрытииСмены.ОставитьСуммуРазменаВКассеККМ") Тогда
		Элементы.МаксимальнаяСуммаРазмена.Доступность = Ложь;
		Запись.МаксимальнаяСуммаРазмена = 0;
	Иначе
		Элементы.МаксимальнаяСуммаРазмена.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

