
#Область ПрограммныйИнтерфейс

// Функция подготавливает структуру,
// заполненную пустыми значениями,
// которая используется для проверки запрета розничной продажи.
// Возвращаемое значение
//		СтруктураПроверки - Структура
Функция ПараметрыПроверкиЗапретаРозничнойПродажи(Объект) Экспорт 
	
	СтруктураПроверки = Новый Структура;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ТекущаяДата = ТекущаяДатаСеанса();
	#Иначе
		ТекущаяДата = ТекущаяДата();
	#КонецЕсли

	СтруктураПроверки.Вставить("Магазин", Объект.Магазин);
	СтруктураПроверки.Вставить("Дата", ТекущаяДата);
	СтруктураПроверки.Вставить("ТекстСообщения", НСтр("ru = 'Номенклатура %1 запрещена к продаже.'"));
	
	Возврат СтруктураПроверки;
	
КонецФункции

#КонецОбласти
