#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
// 		Возвращаемое значение:
// 		Массив - имена блокируемых реквизитов.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ЗначениеРасчетаПремий");
	Результат.Добавить("СегментНоменклатурыРасчетаПремий");
	Результат.Добавить("СпособРасчетаПремий");
	Результат.Добавить("ВариантСовместногоРасчетаПремий");
	Результат.Добавить("ПорядокОкругления");
	Результат.Добавить("УсловияНачисленияПремий");
	Результат.Добавить("Родитель");
	
	Возврат Результат;
	
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
