
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Контрагент", "Контрагент");
	СтруктураРеквизитов.Вставить("Магазин", "Магазин");
	
	Реквизиты = ОбщегоНазначенияРТВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(ПараметрКоманды, СтруктураРеквизитов);
	Магазин = Реквизиты.Магазин;
	Поставщик = Реквизиты.Контрагент;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"                  , Новый Структура("Поставщик, Магазин", Поставщик, Магазин));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта"           , "СостояниеРасчетовСПоставщикамиИзДокумента");
	
	ОткрытьФорму("Отчет.СостояниеРасчетовСПоставщиками.Форма", ПараметрыФормы,,, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти
