
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаФормулыМЖ(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка")
		И ЗначениеЗаполнено(Результат) Тогда
		ИнформационныеРассылкиКлиент.ОбработатьВставкуПараметра(Элементы.ТекстСообщения, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстСообщения") Тогда
		ТекстСообщения = Параметры.ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Закрыть(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПараметр(Команда)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОбработкаФормулыМЖ", ЭтотОбъект);
	ИнформационныеРассылкиКлиент.ВставитьПараметр(Элементы.ТекстСообщения, ОбработчикОповещения);
	
КонецПроцедуры

#КонецОбласти
