#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	РазрешенаРаботаСОблачнымАрхивом = ОблачныйАрхив.РазрешенаРаботаСОблачнымАрхивом();
	Если РазрешенаРаботаСОблачнымАрхивом = Ложь Тогда
		Отказ = Истина;
		СтандартнаяОбработка= Ложь;
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузитьЗначенияПоУмолчанию(Команда)

	КомандаЗагрузитьЗначенияПоУмолчаниюНаСервере();
	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КомандаЗагрузитьЗначенияПоУмолчаниюНаСервере()

	РегистрыСведений.ДоступныеВерсииАгентаКопированияОблачногоАрхива.ЗагрузитьСтандартныеЗначения();

КонецПроцедуры

#КонецОбласти
