#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.Дата КАК ПЕРИОД,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.НомерСтроки,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.Магазин КАК МагазинРасчетаПремий,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Магазин КАК МагазинПродаж,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.ФизЛицо КАК Продавец,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.ПравилоРасчетаПремий,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.ПериодРасчетаДатаНачала КАК ПериодРасчетаДатаНачала,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.ПериодРасчетаДатаОкончания КАК ПериодРасчетаДатаОкончания,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Количество КАК Количество,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.СуммаПродаж КАК СуммаПродаж,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.СуммаПремии
		|ИЗ
		|	Документ.РасчетПремийПоЛичнымПродажам.ТаблицаПремий КАК РасчетПремийПоЛичнымПродажамТаблицаПремий
		|ГДЕ
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка = &Ссылка
		|";

	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаНачисленныхПремийПоЛичнымПродажам", ТаблицаРезультат);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
