
#Область ПрограммныйИнтерфейс

// Возвращает склонение в выбранном падеже.
Функция ПолучитьСклонениеФИО(ФИО, Падеж, Пол = Неопределено) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ЭтоLinuxСервер = ОбщегоНазначенияРТКлиентСерверПовтИсп.ЭтоLinuxСервер();
	#Иначе
		ЭтоLinuxСервер = ОбщегоНазначенияРТВызовСервера.ЭтоLinuxСервер();
	#КонецЕсли
	
	Если ЭтоLinuxСервер Тогда
		Возврат ФИО;
	Иначе
		Возврат ОбщегоНазначенияРТВызовСервера.ПолучитьСклонениеФИО(ФИО, Падеж, Пол);
	КонецЕсли;
	
КонецФункции

// Функция возвращает Истина, если сервер запущен на Linux.
Функция ЭтоLinuxСервер() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоLinuxСервер = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	Возврат ЭтоLinuxСервер;
КонецФункции

// Возвращает формат суммовых показателей
//
Функция ФорматСуммовыхПоказателей() Экспорт
	
	Формат = "ЧДЦ=2; ЧН=0,00";
	Возврат Формат;
	
КонецФункции

#КонецОбласти

