#Область ЗначенияПоУмолчанию
Функция ПолучитьГруппуУчастниковПрограммыДружба() Экспорт
	
	ГруппаССылка = Справочники.ФизическиеЛица.НайтиПоНаименованию("Участники программы Дружба");
	Если ГруппаССылка.Пустая() Тогда
		НовыйГруппаДружба = Справочники.ФизическиеЛица.СоздатьГруппу();
		НовыйГруппаДружба.Наименование = "Участники программы Дружба";
		НовыйГруппаДружба.Записать();
		ГруппаССылка = НовыйГруппаДружба.Ссылка;
	КонецЕсли;	
	Возврат ГруппаССылка
КонецФункции // ПолучитьГруппуУчастниковПрограммыДружба()

Функция ПолучитьГруппуДисконтнойКартыПрограммыДружба() Экспорт

	ГруппаССылка = Справочники.ИнформационныеКарты.НайтиПоНаименованию("Участники программы Дружба");
	Если ГруппаССылка.Пустая() Тогда
		НовыйГруппаДисконтнойКартыПрограммыДружба = Справочники.ИнформационныеКарты.СоздатьГруппу();
		НовыйГруппаДисконтнойКартыПрограммыДружба.Наименование = "Участники программы Дружба";
		НовыйГруппаДисконтнойКартыПрограммыДружба.Записать();
		ГруппаССылка = НовыйГруппаДисконтнойКартыПрограммыДружба.Ссылка;
	КонецЕсли;	
	Возврат ГруппаССылка

КонецФункции // ()

Функция ПолучитьВидДисконтнойКартыПрограммыДружба() Экспорт

	ГруппаССылка = Справочники.ВидыДисконтныхКарт.НайтиПоНаименованию("Участники программы Дружба");
	Если ГруппаССылка.Пустая() Тогда
		НовыйВидыДисконтныхКарт = Справочники.ИнформационныеКарты.СоздатьЭлемент();
		НовыйВидыДисконтныхКарт.Наименование = "Участники программы Дружба";
		НовыйВидыДисконтныхКарт.Записать();
		ГруппаССылка = НовыйВидыДисконтныхКарт.Ссылка;
	КонецЕсли;	
	Возврат ГруппаССылка

КонецФункции // ()

Функция ПолучитьБонуснуюПрограммуДружба() Экспорт

	ГруппаССылка = Справочники.БонусныеПрограммыЛояльности.НайтиПоНаименованию("Дружба");
	Если ГруппаССылка.Пустая() Тогда
		НовыйБонусныеПрограммыЛояльности = Справочники.БонусныеПрограммыЛояльности.СоздатьЭлемент();
		НовыйБонусныеПрограммыЛояльности.Наименование = "Дружба";
		НовыйБонусныеПрограммыЛояльности.УменьшатьСуммуЧекаДляСкидок = Истина;
		НовыйБонусныеПрограммыЛояльности.МаксимальныйПроцентОплатыБонусами = 50;
		НовыйБонусныеПрограммыЛояльности.Записать();
		ГруппаССылка = НовыйБонусныеПрограммыЛояльности.Ссылка;
	КонецЕсли;	
	Возврат ГруппаССылка

КонецФункции // ()

Функция ПолучитьСтроковоеПредставлениеНомераБК(НомерБК) Экспорт
	
	Возврат Формат(НомерБК,"ЧГ=");

КонецФункции	

Функция ПолучитьКоличествоБонусныхБалловЗаРегистрациюПоРекомендации() Экспорт
	Возврат 300
КонецФункции 

Функция ПолучитьПроцентУровняДляНачисленияБонусныхБаллов(Уровень) Экспорт
	Процент = 0;
	Если Уровень = 1 Тогда
		Процент = 3;
	ИначеЕсли Уровень = 2 Тогда
		Процент = 3;
	ИначеЕсли Уровень = 3 Тогда
		Процент = 1;
	КонецЕсли;	
	Возврат Процент
КонецФункции

Функция ПолучитьТипФайла_СводныйОтчетПоСмене() Экспорт
	Возврат ТипФайлаТабличногоДокумента.HTML5;
КонецФункции	

Функция ПолучитьТочностьОкругленияПриРасчетеБонусныхБаллов(Уровень)
	
	ТочностьОкругления = 2;
	
	Если Уровень = 1 Тогда
		ТочностьОкругления = 2;
	ИначеЕсли Уровень = 2 Тогда
		ТочностьОкругления = 2;
	ИначеЕсли Уровень = 3 Тогда
		ТочностьОкругления = 2;
	КонецЕсли;	
	
	Возврат ТочностьОкругления
	
КонецФункции	

/////////////////////////////////////////////// ПОЛУЧАТЕЛИ ОТЧЕТНОСТИ

Функция ПолучитьАдресаEmailДляОтправки_СводныйОтчетПоСмене() Экспорт
	
	АдресаПолучателя = Новый Массив;
	АдресПолучателя = Новый Структура("Адрес, Представление","banya.office@gmail.com","Николаевские бани");
	АдресаПолучателя.Добавить(АдресПолучателя);
	АдресПолучателя = Новый Структура("Адрес, Представление","alaptev@mail.ru","alaptev");
	АдресаПолучателя.Добавить(АдресПолучателя);
	АдресПолучателя = Новый Структура("Адрес, Представление","tkachevlv@inbox.ru","tkachev");
	АдресаПолучателя.Добавить(АдресПолучателя);
	
	Возврат АдресаПолучателя
КонецФункции	

Функция ПолучитьНомераДляОтправкиSMS_СводныйОтчетПоСмене() Экспорт
	
	НомераПолучателей = Новый Массив;
//	НомераПолучателей.Добавить("+79138314190");
	НомераПолучателей.Добавить("+79039210813");
	НомераПолучателей.Добавить("+79135400760");
	
	Возврат НомераПолучателей
КонецФункции	


/////////////////////////////////////////////// СЛУЖЕБНЫЙ

Функция ПолучитьРасширениеПоТипуФайла(ТипФайла) Экспорт
	Расш = "";
	ТипФайлаСтрокой = Строка(ТипФайла);
	Если СтрНайти(ТипФайлаСтрокой,"XLS")>0 Тогда
		Расш = "xls";	
	ИначеЕсли СтрНайти(ТипФайлаСтрокой,"HTML")>0 Тогда
		Расш = "htm";	
	КонецЕсли;	
	Возврат Расш
КонецФункции	
#КонецОбласти	
