
#Область СлужебныеПроцедурыИФункции

// Возвращает необходимость проверки напоминания создания документов ЕГАИС
Функция ПроверятьНеобходимостьСозданияДокументовЕГАИС() Экспорт
	
	Возврат ИнтеграцияЕГАИСРТВызовСервера.ПроверятьНеобходимостьСозданияДокументовЕГАИС();
	
КонецФункции

// Возвращает необходимость выгрузки немаркируемой продукции в ЕГАИС
Функция ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС() Экспорт
	
	Возврат ИнтеграцияЕГАИСРТВызовСервера.ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС();
	
КонецФункции

#КонецОбласти