#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет, возможно ли ввести документ ввода остатков.
//
// Параметры:
//  Узел - ПланОбменаСсылка.
//
Функция ВозможноВвестиВводОстатковДляУзла(Узел) Экспорт
	
	ИмяУзла = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(Узел);
	ПредопределенныйУзел = ОбменДаннымиПовтИсп.ПолучитьЭтотУзелПланаОбмена(ИмяУзла);
	ВозможностьВвода = ПредопределенныйУзел <> Узел И ПланыОбмена.ГлавныйУзел() <> Узел;
	
	Возврат ВозможностьВвода;

КонецФункции

// Проверяет, возможно ли провести документ ввода остатков.
//
// Параметры:
//  Узел - ПланОбменаСсылка.
//
Функция ВозможноПровестиВводОстатковВУзле(Узел) Экспорт
	
	Возврат Узел = ПланыОбмена.ПоМагазину.ЭтотУзел(); 
	
КонецФункции

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Узел КАК Узел
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ФормироватьДвижения", ВозможноПровестиВводОстатковВУзле(Реквизиты.Узел));
	
	Запрос.Текст = 
	"//0 ТаблицаТоварыНаСкладах
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Количество               КАК Количество
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ТоварыНаСкладах КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//1 ТаблицаДенежныеСредстваККМ
	|ВЫБРАТЬ
	|	ТаблицаДенежныеСредства.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаДенежныеСредства.КассаККМ КАК КассаККМ,
	|	ТаблицаДенежныеСредства.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ТаблицаДенежныеСредства.Сумма КАК Сумма
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ДенежныеСредстваККМ КАК ТаблицаДенежныеСредства
	|ГДЕ 
	|   ТаблицаДенежныеСредства.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//2 ТаблицаЦеныНоменклатуры
	|ВЫБРАТЬ
	|   &Период КАК Период,
	|   ЦеныНоменклатуры.НомерСтроки КАК НомерСтроки,
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатуры.Упаковка КАК Упаковка,
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ 
	|   &ФормироватьДвижения
	|   И ЦеныНоменклатуры.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//3 ТаблицаДействующиеЦеныНоменклатуры
	|ВЫБРАТЬ
	|   &Период КАК Период,
	|   ДействующиеЦеныНоменклатуры.НомерСтроки КАК НомерСтроки,
	|	ДействующиеЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДействующиеЦеныНоменклатуры.Характеристика КАК Характеристика,
	|	ДействующиеЦеныНоменклатуры.Магазин КАК ОбъектЦенообразования,
	|	ДействующиеЦеныНоменклатуры.Упаковка КАК Упаковка,
	|	ДействующиеЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ДействующиеЦеныНоменклатуры КАК ДействующиеЦеныНоменклатуры
	|ГДЕ 
	|   ДействующиеЦеныНоменклатуры.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//4 ТаблицаДенежныеСредстваНаличные
	|ВЫБРАТЬ
	|	ТаблицаДенежныеСредстваНаличные.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаДенежныеСредстваНаличные.Касса КАК Касса,
	|	ТаблицаДенежныеСредстваНаличные.Касса.Магазин КАК Магазин,
	|	ТаблицаДенежныеСредстваНаличные.Сумма КАК Сумма,
	|	ТаблицаДенежныеСредстваНаличные.Организация КАК Организация,
	|	ТаблицаДенежныеСредстваНаличные.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ДенежныеСредстваНаличные КАК ТаблицаДенежныеСредстваНаличные
	|ГДЕ 
	|   ТаблицаДенежныеСредстваНаличные.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
    |
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//5 ТаблицаТоварыОрганизаций
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	ТаблицаТовары.Контрагент               КАК Поставщик,
	|	ТаблицаТовары.Договор                  КАК Договор,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.НомерГТД                 КАК НомерГТД,
	|	ТаблицаТовары.Количество               КАК Количество,
	|   ТаблицаТовары.Организация              КАК Организация
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ТоварыОрганизаций КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//6 ТаблицаСебестоимостьНоменклатуры
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Магазин                  КАК Магазин,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Цена                     КАК Цена
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.СебестоимостьНоменклатуры КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//7 ТаблицаТоварыКПоступлению
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Количество               КАК Количество,
	|   ТаблицаТовары.Ссылка                   КАК ДокументОснование
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ТоварыКПоступлению КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//8 ТаблицаТоварыКОтгрузке
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Склад                    КАК Склад,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Количество               КАК Количество,
	|	ТаблицаТовары.Ссылка                   КАК ДокументОснование
	|ИЗ
	|	Документ.ВводНачальныхОстатковУзла.ТоварыКОтгрузке КАК ТаблицаТовары
	|ГДЕ 
	|   ТаблицаТовары.Ссылка = &Ссылка
	|   И &ФормироватьДвижения
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////";
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыНаСкладах"            , Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваККМ"        , Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры"           , Результат[2].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДействующиеЦеныНоменклатуры", Результат[3].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаличные"   , Результат[4].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыОрганизаций"          , Результат[5].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаСебестоимостьНоменклатуры"  , Результат[6].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыКПоступлению"         , Результат[7].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыКОтгрузке"            , Результат[8].Выгрузить());
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

