
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.КодыТоваровSKU.Форма.ФормаСписка.Открытие");

	ПараметрыФормы = Новый Структура("Номенклатура", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.КодыТоваровSKU.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти