
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ГруппаПолучателейСкидки") Тогда
		Отчет.ГруппаПолучателейСкидки = Параметры.ГруппаПолучателейСкидки;
		ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.ГруппаПолучателейСкидки, "ЭтоГруппа");
		Если ЭтоГруппа Тогда
			ТекстОшибки = НСтр("ru = 'Выберите элемент, а не группу'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти
